using Microsoft.EntityFrameworkCore;
using PeaksAndAdventures.Core.Interfaces;
using PeaksAndAdventures.Core.Models.ViewModels.Mountain;
using PeaksAndAdventures.Core.Services;
using PeaksAndAdventures.Infrastructure.Data;
using PeaksAndAdventures.Infrastructure.Data.Common;
using PeaksAndAdventures.Infrastructure.Data.Enums.Hut;
using PeaksAndAdventures.Infrastructure.Data.Enums.Route;
using PeaksAndAdventures.Infrastructure.Data.Models;

namespace PeaksAndAdventures.Tests
{
	[TestFixture]
	public class MountainServiceTests
	{
		private PeaksAndAdventuresDbContext _context;

		private IRepository _repository;
		private IMountainService _mountainService;

		private IEnumerable<Mountain> _mountains;
		private IEnumerable<Peak> _peaks;
		private IEnumerable<Hut> _huts;
		private IEnumerable<Lake> _lakes;
		private IEnumerable<Waterfall> _waterfalls;
		private IEnumerable<Route> _routes;
		private IEnumerable<RouteHut> _routeHuts;
		private IEnumerable<RouteLake> _routeLakes;

		[SetUp]
		public void SetUp()
		{
			var options = new DbContextOptionsBuilder<PeaksAndAdventuresDbContext>()
				.UseInMemoryDatabase(databaseName: "PeaksAndAdventuresTest" + Guid.NewGuid().ToString())
				.Options;

			_context = new PeaksAndAdventuresDbContext(options);

			_repository = new Repository(_context);
			_mountainService = new MountainService(_repository);

			_mountains = new List<Mountain>
			{
				new Mountain
				{
					 Id = 1,
				Name = "Рила",
				Location = "Рѝла е най-високата планина в България и на Балканския полуостров. Намира се в югозападната част на страната, и по-точно в северозападния край на Рило-Родопския планински масив. Най-високият връх на планината – Мусала, със своите 2925,2 m е и най-високият на Балканския полуостров и цяла Източна Европа. По билото на Рила минава Главният български вододел, който съвпада с Главния балкански вододел, разделящ водосборните басейни на Черно и Егейско море.\r\n\r\nВ Европа Рила се нарежда на 6-о място по височина след планините: Кавказ (връх Елбрус – 5642 m), Алпите (връх Монблан – 4807 m), Сиера Невада (връх Муласен – 3479 m), Пиренеите (връх Ането – 3404 m) и Етна (3357 m). От планината извират едни от най-големите и пълноводни български реки – Искър, Марица и Места.",
				Climate = "Рила има типичен планински климат. На връх Мусала (2925 m) падат 2000 mm валежи годишно като 80% от тях са от сняг. Там са измерени най-ниските температури за планината – абсолютна минимална температура -31,2 \u00b0C при средна месечна температура -11,6 \u00b0C, измерена през февруари. Абсолютната максимална температура е 18,7 \u00b0C. Отрицателните температури се задържат средно около 9 месеца, като често продължават до края на юни. Устойчиво повишаване на температурата се наблюдава към средата и края на юли. Но дори и през летните месеци температурата не се задържа трайно над 10 \u00b0C. От 5 до 10 дни през юни, юли и август са със средна температура над 15 \u00b0C. Това определя краткия вегетационен период във високопланинските части. Той варира от 3 до 6 месеца, като над 2000 метра надморска височина трае около 3 месеца.\r\n\r\nВъв високите части на Рила относителната влажност на въздуха най-често е в границите от 80 до 85%. Най-сухи са студените, зимни месеци. Влажността е различна за северните и южни склонове на Рила. По южните склонове на планината валежите през зимата достигат до 22 – 25% от годишната норма, докато по северните склонове са занижени. По западните и северни склонове максимумът на валежите е през пролетта и лятото, а по източните склонове – през зимата.\r\n\r\n\r\nРавни чал\r\nТрайно формиране на снежна покривка в зоните непосредствено над 1000 m надморска височина се наблюдава след 10 – 15 декември – за северните склонове, а за южните – след 20 – 30 декември. Снежната покривка се задържа средно 200 – 220 дни в годината, като за ниската зона на планината тя е най-дебела през февруари. Тогава средната месечна дебелина достига 20 – 30 cm. Във високата зона – над 2000 m надморска височина – снежната покривка е най-дебела през март – 70 – 80 cm. В най-високите части максималната дебелина на снежната покривка достига 200 – 240 cm. Средната продължителност на периода с устойчива снежна покривка е 70 – 80 дни за надморска височина 1200 – 1300 m, а при надморска височина над 2000 m достига до 180 – 200 дни. Не са изключение ветрове със скорост 30 – 40 m/s (над 100 km/h), с предимно югозападна и западна ориентация. Северозападните и североизточните ветрове са по-умерени. Средната месечна скорост на вятъра по най-високите планински върхове достига 11 – 12 m/s. В по-ниските части средната месечна скорост се изменя от 1,2 до 2,5 m/s, а в средната височинна зона от 2,5 – 3,2 m/s. ",
				Waters = "Рила е важен хидроложки възел за България с изключително голям хидроенергиен потенциал, представляващ около 1/4 от целия потенциал на страната. Планината попада в хидроложката област с континентално климатично влияние, планинска подобласт. По северните ѝ склонове и връх Мусала минава главният вододел, разделящ двата отточни басейна – Черноморския и Беломорския (Егейски).Водните запаси, които се формират в границите на планината са най-важният ресурс на чиста питейна вода за околните селища, София, част от населението на Северна Гърция и европейската част на Турция. Районът на населените места, разположени по западните склонове на Рила планина разполага с голям излишък от вода, тъй като оттокът надвишава потреблението около 8 пъти. Режимът на рилските реки е в пряка връзка с надморската височина и около половината от водните запаси в планината се намират на височина над 2050 m. От планината извират едни от най-пълноводните и дълги реки на Балканите – Искър, Марица и Места. Изворите на много притоци на тези реки, както и на притоци на Струма, също се намират във високопланинските части на Рила – Бели, Леви, Прав и Черни Искър, Бяла и Черна Места, реките Белишка, Благоевградска Бистрица, Градевска, Рилска. На територията на планината се формират около 10% от водните ресурси на Струма и Места, над 5% от тези на р. Марица и повече от 8% на р. Искър. Поради екзарационната дейност на ледниците през кватернера във високопланинските части на Рила са се образували голям брой ледникови езера. От тях по-голямата част са постоянни, около 35 са временни и за всички са характерни малките площ и обем. Обикновено заемат дъната на циркусите, циркусните тераси и троговите долини и са разположени на надморска височина между 2000 и 2600 m. Най-често имат закръглена или елипсовидна форма с малки дължина и ширина, като повечето са с площ под 10 дка. Тези води имат значение не толкова с количеството си, отколкото със своето качество и красотата на езерата, която привлича ежегодно хиляди туристи. Веригата на Седемте рилски езера е най-дългата, най-живописна и най-посещавана езерна група. В Рила са описани около 233 езера, от които 189 циркусни, а останалите имат тектонски или свлачищен произход.",
				Flora = "В Рила растат:\r\n\r\nдървета – обикновен габър (Carpinus betulus), зимен дъб (Quercus petraea), обикновен бук (Fagus sylvatica), трепетлика (Populus tremula), бреза (Betula pendula), обикновена ела (Abies alba), бяла мура (Pinus peuce), обикновен смърч (Picea abies), бял бор (Pinus sylvestris) покриват планинските склонове между 1600 до 2000 m.\r\nцветя – алпийска камбанка (Campanula alpina), планинско омайниче (Dryas octopetala), пролетна съсънка (Pulsatilla vernalis), иглика.",
				Fauna = "Общо 24 вида от срещащите се в Рила животни са вписани в Световната Червена книга. Гръбначните животни са 172 вида като 121 от тях са вписани в Българската Червена книга, 15 вида – в европейската Червена книга, 24 вида – в червения списък на Международния съюз за защита на природата (IUCN), а 158 – в списъците към Бернската конвенция.\r\n\r\nБезгръбначни\r\nВ Рила се срещат 2934 вида безгръбначни животни, като 242 са ендемични видове и подвидове. Общо 13 вида от безгръбначните животни живеещи тук са застрашени от изчезване в световен мащаб, а 41 вида са включени в световни и европейски списъци на застрашени видове.[38]\r\n\r\nРиби\r\nВ Рила се срещат 5 вида риби. Различни източници сочат, че видовото разнообразие на рибите достига до 18 като 4 от тях са балкански ендемити.[39] Дъговата и балканската пъстърва обитава езерата и язовирите и по-рядко реките Марица, Ибър, Крива река, Джерман. В рилските езера е широко разпространена лешанката. Видът е интродуциран за стръв от рибари. Някои от езерата са зарибени със сивен. Главочът се среща по-рядко, основно в река Черни Искър.\r\n\r\nЕндемитните видове в Рила са български – главоч (Cottus gobio haemusi) и струмски гулеш (Nemacheilus angorae bureschi) и балкански – маришка мряна (Barbus cyclolepis) и балкански щипок (Sabanejewia aurata balcanica).\r\n\r\nЗемноводни и влечуги\r\nПланината е обитавана от 20 вида земноводни и влечуги. Сред видовете, които се срещат в най-високите части на планината са планинска водна жаба, алпийски тритон, слепок, живороден гущер, ливаден гущер, усойница и медянка. От тях ендемичен вид е македонският гущер.\r\n\r\nПтици\r\nПтиците са представени от 99 вида (около 25% от орнитофауната на България) като тук са най-многобройните популации на глухара, лещарката и планинския кеклик, на пернатоногата и малката кукумявка. Тук се намират и едни от най-жизнените популации на хищни птици. От вписаните в Червената книга птици тук се срещат осояд, скален орел, горски бекас, белогръб кълвач, черен кълвач, малък креслив орел, сокол орко, голям ястреб, орел змияр, ловен сокол и други. Девет вида птици са престанали да гнездят тук.[40]\r\n\r\nБозайници\r\n\r\nЛешников сънливец\r\nБозайниците в Рила са 48 вида като тук е характерна популацията на дивата коза и високопланинската популация на лалугера.[38] Прилепите в Рила са десет, а дребните бозайници се подразделат на насекомоядни, зайци и гризачи. От тях са интересни таралежът, лешниковият сънливец и сляпото куче. Лалугерът е световно застрашен вид. Стабилна, но изолирана високопланинска колония от лалугери е установена в района на връх Белмекен. От по-едрите представители на бозайниците подвидовете на невестулката (Mustela nivalis galinthias) и дивата коза (Rupicapra rupicapra balcanica) са балкански ендемити.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Maliovitsa_District_Rila.jpg/1280px-Maliovitsa_District_Rila.jpg"
				},
				new Mountain 
				{  
					Id = 2,
				Name = "Пирин",
				Location = "Пирин е разположен в югозападната част на страната между долините на реките Струма и Места, между 41\u00b026' и 41\u00b056' северна ширина. На север граница с Рила е седловината Предел (1142 м), а на юг – Парилската седловина (1170 м), която отделя Пирин от планината Славянка. На североизток планината достига до долината на река Места с Разложката и Гоцеделчевската котловина и пролома Момина клисура, я отделят от Родопите. На запад и югозапад долината на река Струма със своите котловини Симитлийска и Петричко-Санданска и Кресненският пролом я отделят от планините Влахина, Малешевска и Огражден.\r\n\r\nПлощта на планината е 2585 квадратни километра, т.е. тя е сравнително компактна, малка планина, което се потвърждава и от голямата ѝ средна височина – 1033 метра. Дължината ѝ по права линия от северозапад на югоизток е 66 км, а максималната ѝ широчина в направление югозапад-североизток е 40 километра – от град Сандански до село Обидим.",
				Climate = "Климатът в Пирин се отличава с голямо разнообразие, следствие от големите разлики в надморската височина, експозицията на склоновете, разчленението и подстилащата повърхнина. В по-ниските части и в долините на Струма и Места има силно средиземноморско влияние.\r\n\r\nНа север в района на Разложката котловина, разположена на ок. 940 м.н.в. е характерен умереноконтиненталния климат, дължащ се главно на голямата надморска височина на котловината. Средните януарски температури са ок. -2 \u00b0C, а валежите ок. 650 – 700 мм., като максимумът им е през ноември и вторичен – през юни. На юг в района на Гоцеделчевската котловина климатът е с преходносредиземноморски черти. Тук средногодишната температура достига 11,4 \u00b0C, а януарската е ок. 0 \u00b0C, валежите са предимно от дъжд със зимен максимум. Във високите части на планината климатът е типично планински. Средноянуарските температури варират от -1 до -2 \u00b0C в подножието и до -5 \u00b0C в по-високите части. Средната годишна температура на хижа „Вихрен“ е +3,5 \u00b0C. Количеството на валежите варира от 600 – 800 мм в по-ниските части до 1400 – 1500 мм в по-високите. Снежната покривка се задържа в по-високите части 7 – 8 месеца, а в Южен Пирин около 3 месеца. Често във високите части на планината през зимата се образуват опасни лавини.",
				Waters = "Пирин е много водна планина. Тя дава началото на голям брой реки, които принадлежат към водосборните басейни на Струма и Места. Те са сравнително къси, буйни и пълноводни, с голям наклон, поради което по тях се образуват множество водопади, прагове и бързеи. Има няколко по-изявени водопада – Влахинският водопад, Скоко, Попинолъшкият (15 м), Демянишки скок (11 м) и Юленски скок (9 м). Вододелът между водосборните басейни на Струма и Места минава по централното пиринско било. Пиринските реки имат снежно-дъждовен режим със силно изразен пролетен максимум. Най-голямото водно богатство на Пирин са красивите езера. На брой 186, те имат ледников произход, разположени са в малки и големи циркуси. Поради този си произход те са сравнително дълбоки, бистри, а поради височината – много студени. ",
				Flora = "Пирин е извънредно богат на растения и животни. Установени са около 1300 вида висши растения, което е 1/3 от всичките познати в България, 320 вида мъхове и няколкостотин вида водорасли. Висок е процентът на локалните ендемити – растения, които се срещат само в Пирин. Те са 18 на брой – пирински мак, пиринска ливадина, пиринска мащерка, давидов лопен и др. Много от растенията са редки и защитени, като например познатият на всички еделвайс, който се среща най-вече по Джамджиевите скали под Вихрен. Растителността е вертикално зонирана в три височинни пояса – горски, субалпийски и алпийски. Горският пояс е зает предимно от иглолистни дървета – бял и черен бор, бяла и черна мура, ела, обикновен смърч и достига приблизително до 2000 м. Оттам нагоре до 2500 м следва субалпийският пояс, в който доминират храстите клек и хвойна, чиито размери намаляват с увеличаването на височината. Накрая идва ред на алпийският пояс, зает от треви, лишеи и мъхове, а на границата между двата в изобилие се среща черната боровинка. По-особена е растителността край водните басейни, където най-често могат да се срещнат представителина рода на острицата. Най-известното дърво в Пирин е Байкушевата мура, носеща името на откривателя си, лесовъда Коста Байкушев. През 1897 година той изследва дървото с тръбна сонда и изчислява възрастта му на 1200 години. Приблизителните ѝ размери са височина 24 м, диаметър 2,2 м и обиколка 7,8 м.",
				Fauna = "Още по-голямо е богатството на животински видове. Познати са над 2000 вида и подвида безгръбначни животни (паяци, стоножки, насекоми, охлюви) и почти 250 вида гръбначни. От последните преобладават птиците (177 вида) и бозайниците (45 вида), а рибите са само 6 вида. Много от тези животни са застрашени и се нуждаят от специална защита – скален орел, трипръст кълвач, планински кефал, шипоопашата костенурка. Най-често могат да се срещнат дива коза, сърна, мечка, вълк, лисица, орел, сокол, глухар и др.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Pogled_kum_prez_gr_Petrich_kum_gr_Sandanski.jpg/1280px-Pogled_kum_prez_gr_Petrich_kum_gr_Sandanski.jpg",
				},
			};

			_peaks = new List<Peak>
			{
				new Peak {   Id = 1,
					Name = "Мусала",
					Altitude = 2925,
					Partition = "Източна Рила",
					Description = "Мусала е първенецът на Рила и най-високият планински връх в България и на целия Балкански полуостров. Надморската му височина е 2925,4 m, измерена от равнището на пристанище Варна. По-висок е с 8 m от следващия по височина връх на Балканите, Митикас в планината Олимп в Гърция, и с 11 m от първенеца на Пирин, връх Вихрен, който заема третото място в класацията. Мусала има относителна надморска височина от 2473 m, което го подрежда на 7-о място в Европа.",
					ImageUrl = "https://svetogled.com/wp-content/uploads/2021/08/DSC_0050_1.jpg",
					MountainId = 1 },
				new Peak {  Id = 2,
					Name = "Юрушки чал",
					Altitude = 2769,
					Partition = "Източна Рила",
					SpecificLocation = "С от хижа Грънчар",
					MountainId = 1 },
				new Peak {  Id = 3,
					Name = "Вихрен",
					Altitude = 2914,
					Partition = "Северен Пирин",
					Description = "Вѝхрен (до 29 юни 1942 г. Елтепе, Ел-тепе) е най-високият връх на Пирин. Със своите 2914 метра Вихрен е втори по височина в България след Мусала (2925,4) в Рила и трети на Балканския полуостров след Митикас (2917,727[3]) в Олимп. Гледан от Банско Вихрен прилича на пресечена пирамида, а от юг – на четиристенна пирамида. За този връх е характерно, че изглежда по много различен начин от различните посоки. Скалите, които изграждат Вихрен, са мрамори, които не задържат вода, поради което в целия район на върха няма реки и езера. Най-близките езера са Влахините на югозапад. Растителността по склоновете на Вихрен е бедна – трева и лишеи, докато животинският свят е по-богат – има птици, дребни гризачи, но най-вече диви кози, които обитават Казаните в подножието на върха. Цветето еделвайс се среща в изобилие по скалния ръб Джамджиеви скали.",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/07/MANE2800a.jpg",
					MountainId = 2 }
			};

			_huts = new List<Hut>
			{
				new Hut
				{
					Id = 1,
					Name = "Синаница",
					Altitude = 2185,
					Camping = Camping.Permitted,
					WorkTime = WorkTime.Summer,
					Description = "Разположена е на северния бряг на Синанишкото езеро, в непосредствена близост до връх Синаница. Хижата представлява масивна двуетажна постройка. На първия етаж е разположена просторна столова с кухня, има складови помещения и спално помещение за домакина. На втория етаж са обособени спалните помещения за туристи, като хижата може да приюти до 50 души. През летния сезон пред хижата се открива палатков лагер.Водоснабдена е и електрифицирана от генератор. Санитарните помещения са външни. През зимния сезон в хижата няма поддържащ персонал.Хижа „Синаница“ е построена през 1975 – 1977 г. от Туристическото дружество на гара Пирин – днешния град Кресна.",
					HasToilet = true,
					HasCanteen = true,
					HasBathroom = true,
					Places = 48,
					Phone = "0894360427",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSCF1118-819x1024.webp",
					MountainId = 2
				}
			};

			_lakes = new List<Lake>
			{
				new Lake
				{
					Id = 1,
					Name = "Синанишко",
					Description = "Синанишкото езеро (Голямо Синивръшко езеро) е езеро в западния склон на Северен Пирин, разположено в дълбок циркус на 650 m на север-североизток от връх Синаница (Сини връх), на 2181 m н.в. Със своите 11,5 m дълбочина то е сред 10-те най-дълбоки езера в Пирин.Има продълговата форма (140 на 90 m) и площ от 1,01 ha. Оттича се подземно, но водите му излизат на повърхността след 120 m и дават началото на Синанишката река, ляв приток на река Влахинска река, ляв приток на Струма. На северния бряг на езерото е изградена хижа Синаница.",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSCF1129-1024x683.webp",
					MountainId = 2
				},
			};

			_waterfalls = new List<Waterfall>
			{
				new Waterfall
				{
					Id = 2,
					Name = "Рилска скакавица",
					Description = "Водопад Рилска Скакавица е най-високият водопад в Рила (70 метра). Разположен е на 1750 метра надморска височина, а местността покрай него е много красива. Реката, която го захранва се нарича Скакавица, а преходът до него не е труден и е по добре маркирана пътека. Намира се на 10-на минути от хижа Скакавица, а за нея се тръгва от Паничище. Пътеката започва от началната станция на лифта за Седемте рилски езера и е добре обозначена с табели и маркировка. След като стигнете до хижата, следвате пътеката покрай реката, която ще ви отведе до подножието на водопада. През зимата водопадът замръзва.",
					ImageUrl = "https://bookvila.bg/img/210711093630.jpg",
					MountainId = 1
				},
			};

			_routes = new List<Route>
			{
				new Route { 
					Id = 1,
					Name = "Хижа „Синаница“ и Синанишко езеро – едно от най-красивите в България",
					StartingPoint = "Хижа Вихрен", 
					Description = "Хижа „Вихрен“ – Муратово езеро\r\nНачалото на маршрута е от хижа „Вихрен“. Следвате синьо-жълтата маркировка, като трябва да тръгнете нагоре по стълбичките пред хижата. Оттам има леко изкачване по камъни, а след това и кратък равен участък. След 10-15 минути от началото на маршрута ще стигнете мостче. Вместо да минавате по него, трябва да тръгнете надясно по камъните, успоредно на реката.\r\nМалко след това има 15 минутно изкачване, което е най-трудната част от маршрута. Пътеката завива надясно и не след дълго пред вас ще се открие Муратовото езеро. В нашата статия може да прочетете подробно описание на маршрута от хижа „Вихрен“ до Муратово езеро.\r\nМуратово езеро – Бъндеришка порта\r\nОт Муратово езеро поемете наляво и продължeте нагоре по сипеите, като следвате синьо-жълтата маркировка. Непременно се обърнете назад, за да се насладите на езерото от високо. След като превалите баира не се заблуждавайте, че това е Бъндеришката порта. Следва по-равна част. Отляво ще видите няколко езера от групата Овинати и продължете по пътеката, която криволичи през клекове. Най-накрая ще зърнете в далечината портата, която е седловината между Муратов връх и Дончови караули.\r\nОттук започва изкачване по морени, камънаци и сипеи. На места е доста стръмно и трябва да си помагате с ръце и да внимавате къде стъпвате. Оглеждайте се за синьо-жълтата маркировка по камъните, за да не се отклоните от целта. Частта от Муратово езеро до Бъндеришка порта се минава за час и малко. След като стъпите на Бъндеришка порта пред вас се разкрива гледка към обширното Спано поле.\r\n\r\n\r\nБъндеришка порта – Синанишка порта\r\nОт Бъндеришката порта следвайте синята маркировка и продължете леко надясно. Следва и най-приятната част от прехода – вървите по почти равна и добре отъпкана пътека. Местността, в която се намирате се нарича Голямо Спано Поле. По пътя може да срещнете много стада с крави и диви коне. Ако стадата са на пътеката е добре да ги заобиколите, защото наоколо е възможно да има и кучета, които да се спуснат към вас, затова бъдете внимателни!\r\n\r\nПътеката към Синанишкото езеро\r\nСлед равния участък започва леко изкачване към Синанишката порта, което не е трудно, но отново трябва да внимавате. Когато стигнете портата идва и една от най-хубавите части – гледката към кристалните води на Синанишкото езеро и стръмните бели склонове на връх Синаница.\r\nСинанишка порта – Синанишко езеро и хижа „Синаница“\r\nОт портата следва продължително слизане към хижа „Синаница“- първоначално по камъни, а след това по мека пътека измежду клековете.\r\nСинанишкото езеро и хижа Синаница\r\nХижата изглежда близо, но слизането е продължително, все надолу и надолу. Най-накрая зад един завой се вижда простор за пране и след него се открива гледка към хижата и сините води на езерото. На юг от езерото се вижда връх Синаница (2516 м).\r\n\r\nСинанишкото езеро\r\nВръх Синаница в Пирин планина\r\nМаршрутът не е много труден, с редуващи се изкачвания и равни участъци и с изглед към красивите пирински езера. Оттук може да изкачите връх Синаница, да минете през Синанишка порта към заслон „Спано поле“ или да се върнете по обратния път до хижа „Вихрен“.",
				Difficulty = Difficulty.Moderate,
				DisplacementNegative = 436,
				DisplacementPositive = 663,
				Duration = "0.03:50",
				ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSCF1021-copy-1024x683.webp",
				MountainId = 2
				},
			};

			_routeHuts = new List<RouteHut>()
			{
				new RouteHut()
				{
					RouteId = 1, HutId = 1
				}
			};

			_routeLakes = new List<RouteLake>()
			{
				new RouteLake()
				{
					RouteId = 1, LakeId = 1
				}
			};

			_context.AddRange(_mountains);
			_context.AddRange(_peaks);
			_context.AddRange(_huts);
			_context.AddRange(_lakes);
			_context.AddRange(_waterfalls);
			_context.AddRange(_routes);
			_context.AddRange(_routeHuts);
			_context.AddRange(_routeLakes);

			_context.SaveChanges();
		}

		[TearDown]
		public async Task TearDown()
		{
			await _context.Database.EnsureDeletedAsync();
			await _context.DisposeAsync();
		}

		[Test]
		public async Task AllMountainsPaginationAsync_ShouldReturnAllMountainsWithPagination()
		{
			var result = await _mountainService.AllMountainsPaginationAsync(1, 6);

			Assert.That(result.Mountains.Count(), Is.EqualTo(2));
			Assert.That(result.TotalPages, Is.EqualTo(1));
		}

		[Test]
		public async Task AllMountainsPaginationAsync_ShouldReturnTwoPages()
		{
			var result = await _mountainService.AllMountainsPaginationAsync(1, 1);

			Assert.That(result.Mountains.Count(), Is.EqualTo(1));
			Assert.That(result.TotalPages, Is.EqualTo(2));
		}

		[Test]
		public async Task DetailsAsync_ShouldReturnMountainDetails()
		{
			var result = await _mountainService.DetailsAsync(1);

			Assert.That(result.Id, Is.EqualTo(1));
			Assert.That(result.Name, Is.EqualTo("Рила"));
			Assert.That(result.Location, Is.EqualTo("Рѝла е най-високата планина в България и на Балканския полуостров. Намира се в югозападната част на страната, и по-точно в северозападния край на Рило-Родопския планински масив. Най-високият връх на планината – Мусала, със своите 2925,2 m е и най-високият на Балканския полуостров и цяла Източна Европа. По билото на Рила минава Главният български вододел, който съвпада с Главния балкански вододел, разделящ водосборните басейни на Черно и Егейско море.\r\n\r\nВ Европа Рила се нарежда на 6-о място по височина след планините: Кавказ (връх Елбрус – 5642 m), Алпите (връх Монблан – 4807 m), Сиера Невада (връх Муласен – 3479 m), Пиренеите (връх Ането – 3404 m) и Етна (3357 m). От планината извират едни от най-големите и пълноводни български реки – Искър, Марица и Места."));
			Assert.That(result.Climate, Is.EqualTo("Рила има типичен планински климат. На връх Мусала (2925 m) падат 2000 mm валежи годишно като 80% от тях са от сняг. Там са измерени най-ниските температури за планината – абсолютна минимална температура -31,2 \u00b0C при средна месечна температура -11,6 \u00b0C, измерена през февруари. Абсолютната максимална температура е 18,7 \u00b0C. Отрицателните температури се задържат средно около 9 месеца, като често продължават до края на юни. Устойчиво повишаване на температурата се наблюдава към средата и края на юли. Но дори и през летните месеци температурата не се задържа трайно над 10 \u00b0C. От 5 до 10 дни през юни, юли и август са със средна температура над 15 \u00b0C. Това определя краткия вегетационен период във високопланинските части. Той варира от 3 до 6 месеца, като над 2000 метра надморска височина трае около 3 месеца.\r\n\r\nВъв високите части на Рила относителната влажност на въздуха най-често е в границите от 80 до 85%. Най-сухи са студените, зимни месеци. Влажността е различна за северните и южни склонове на Рила. По южните склонове на планината валежите през зимата достигат до 22 – 25% от годишната норма, докато по северните склонове са занижени. По западните и северни склонове максимумът на валежите е през пролетта и лятото, а по източните склонове – през зимата.\r\n\r\n\r\nРавни чал\r\nТрайно формиране на снежна покривка в зоните непосредствено над 1000 m надморска височина се наблюдава след 10 – 15 декември – за северните склонове, а за южните – след 20 – 30 декември. Снежната покривка се задържа средно 200 – 220 дни в годината, като за ниската зона на планината тя е най-дебела през февруари. Тогава средната месечна дебелина достига 20 – 30 cm. Във високата зона – над 2000 m надморска височина – снежната покривка е най-дебела през март – 70 – 80 cm. В най-високите части максималната дебелина на снежната покривка достига 200 – 240 cm. Средната продължителност на периода с устойчива снежна покривка е 70 – 80 дни за надморска височина 1200 – 1300 m, а при надморска височина над 2000 m достига до 180 – 200 дни. Не са изключение ветрове със скорост 30 – 40 m/s (над 100 km/h), с предимно югозападна и западна ориентация. Северозападните и североизточните ветрове са по-умерени. Средната месечна скорост на вятъра по най-високите планински върхове достига 11 – 12 m/s. В по-ниските части средната месечна скорост се изменя от 1,2 до 2,5 m/s, а в средната височинна зона от 2,5 – 3,2 m/s. "));
			Assert.That(result.Waters,
				Is.EqualTo(
					"Рила е важен хидроложки възел за България с изключително голям хидроенергиен потенциал, представляващ около 1/4 от целия потенциал на страната. Планината попада в хидроложката област с континентално климатично влияние, планинска подобласт. По северните ѝ склонове и връх Мусала минава главният вододел, разделящ двата отточни басейна – Черноморския и Беломорския (Егейски).Водните запаси, които се формират в границите на планината са най-важният ресурс на чиста питейна вода за околните селища, София, част от населението на Северна Гърция и европейската част на Турция. Районът на населените места, разположени по западните склонове на Рила планина разполага с голям излишък от вода, тъй като оттокът надвишава потреблението около 8 пъти. Режимът на рилските реки е в пряка връзка с надморската височина и около половината от водните запаси в планината се намират на височина над 2050 m. От планината извират едни от най-пълноводните и дълги реки на Балканите – Искър, Марица и Места. Изворите на много притоци на тези реки, както и на притоци на Струма, също се намират във високопланинските части на Рила – Бели, Леви, Прав и Черни Искър, Бяла и Черна Места, реките Белишка, Благоевградска Бистрица, Градевска, Рилска. На територията на планината се формират около 10% от водните ресурси на Струма и Места, над 5% от тези на р. Марица и повече от 8% на р. Искър. Поради екзарационната дейност на ледниците през кватернера във високопланинските части на Рила са се образували голям брой ледникови езера. От тях по-голямата част са постоянни, около 35 са временни и за всички са характерни малките площ и обем. Обикновено заемат дъната на циркусите, циркусните тераси и троговите долини и са разположени на надморска височина между 2000 и 2600 m. Най-често имат закръглена или елипсовидна форма с малки дължина и ширина, като повечето са с площ под 10 дка. Тези води имат значение не толкова с количеството си, отколкото със своето качество и красотата на езерата, която привлича ежегодно хиляди туристи. Веригата на Седемте рилски езера е най-дългата, най-живописна и най-посещавана езерна група. В Рила са описани около 233 езера, от които 189 циркусни, а останалите имат тектонски или свлачищен произход."));
			Assert.That(result.Fauna, Is.EqualTo("Общо 24 вида от срещащите се в Рила животни са вписани в Световната Червена книга. Гръбначните животни са 172 вида като 121 от тях са вписани в Българската Червена книга, 15 вида – в европейската Червена книга, 24 вида – в червения списък на Международния съюз за защита на природата (IUCN), а 158 – в списъците към Бернската конвенция.\r\n\r\nБезгръбначни\r\nВ Рила се срещат 2934 вида безгръбначни животни, като 242 са ендемични видове и подвидове. Общо 13 вида от безгръбначните животни живеещи тук са застрашени от изчезване в световен мащаб, а 41 вида са включени в световни и европейски списъци на застрашени видове.[38]\r\n\r\nРиби\r\nВ Рила се срещат 5 вида риби. Различни източници сочат, че видовото разнообразие на рибите достига до 18 като 4 от тях са балкански ендемити.[39] Дъговата и балканската пъстърва обитава езерата и язовирите и по-рядко реките Марица, Ибър, Крива река, Джерман. В рилските езера е широко разпространена лешанката. Видът е интродуциран за стръв от рибари. Някои от езерата са зарибени със сивен. Главочът се среща по-рядко, основно в река Черни Искър.\r\n\r\nЕндемитните видове в Рила са български – главоч (Cottus gobio haemusi) и струмски гулеш (Nemacheilus angorae bureschi) и балкански – маришка мряна (Barbus cyclolepis) и балкански щипок (Sabanejewia aurata balcanica).\r\n\r\nЗемноводни и влечуги\r\nПланината е обитавана от 20 вида земноводни и влечуги. Сред видовете, които се срещат в най-високите части на планината са планинска водна жаба, алпийски тритон, слепок, живороден гущер, ливаден гущер, усойница и медянка. От тях ендемичен вид е македонският гущер.\r\n\r\nПтици\r\nПтиците са представени от 99 вида (около 25% от орнитофауната на България) като тук са най-многобройните популации на глухара, лещарката и планинския кеклик, на пернатоногата и малката кукумявка. Тук се намират и едни от най-жизнените популации на хищни птици. От вписаните в Червената книга птици тук се срещат осояд, скален орел, горски бекас, белогръб кълвач, черен кълвач, малък креслив орел, сокол орко, голям ястреб, орел змияр, ловен сокол и други. Девет вида птици са престанали да гнездят тук.[40]\r\n\r\nБозайници\r\n\r\nЛешников сънливец\r\nБозайниците в Рила са 48 вида като тук е характерна популацията на дивата коза и високопланинската популация на лалугера.[38] Прилепите в Рила са десет, а дребните бозайници се подразделат на насекомоядни, зайци и гризачи. От тях са интересни таралежът, лешниковият сънливец и сляпото куче. Лалугерът е световно застрашен вид. Стабилна, но изолирана високопланинска колония от лалугери е установена в района на връх Белмекен. От по-едрите представители на бозайниците подвидовете на невестулката (Mustela nivalis galinthias) и дивата коза (Rupicapra rupicapra balcanica) са балкански ендемити."));
			Assert.That(result.Flora, Is.EqualTo("В Рила растат:\r\n\r\nдървета – обикновен габър (Carpinus betulus), зимен дъб (Quercus petraea), обикновен бук (Fagus sylvatica), трепетлика (Populus tremula), бреза (Betula pendula), обикновена ела (Abies alba), бяла мура (Pinus peuce), обикновен смърч (Picea abies), бял бор (Pinus sylvestris) покриват планинските склонове между 1600 до 2000 m.\r\nцветя – алпийска камбанка (Campanula alpina), планинско омайниче (Dryas octopetala), пролетна съсънка (Pulsatilla vernalis), иглика."));
			Assert.That(result.ImageUrls, Is.EqualTo("https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Maliovitsa_District_Rila.jpg/1280px-Maliovitsa_District_Rila.jpg"));
		}

		[Test]
		public async Task DetailsAsync_ShouldReturnNullIfMountainDoesNotExist()
		{
			var result = await _mountainService.DetailsAsync(3);

			Assert.That(result, Is.Null);
		}

		[Test]
		public async Task GetAllPeaksAsync_ShouldReturnAllPeaks()
		{
			var result = await _mountainService.GetAllPeaksAsync(1);

			Assert.That(result.Count(), Is.EqualTo(2));
		}

		[Test]
		public async Task GetAllMountains_ShouldReturnAllMountains()
		{
			var result = await _mountainService.GetAllMountains();

			Assert.That(result.Count(), Is.EqualTo(2));
		}

		[Test]
		public async Task GetAllHutsAsync_ShouldReturnAllHuts()
		{
			var result = await _mountainService.GetAllHutsAsync(2);

			Assert.That(result.Count(), Is.EqualTo(1));
		}

		[Test]
		public async Task GetAllHutsAsync_ShouldReturnEmptyCollection()
		{
			var result = await _mountainService.GetAllHutsAsync(1);

			Assert.That(result.Count(), Is.EqualTo(0));
		}

		[Test]
		public async Task GetAllLakesAsync_ShouldReturnAllLakes()
		{
			var result = await _mountainService.GetAllLakesAsync(2);

			Assert.That(result.Count(), Is.EqualTo(1));
		}

		[Test]
		public async Task GetAllLakesAsync_ShouldReturnEmptyCollection()
		{
			var result = await _mountainService.GetAllLakesAsync(1);

			Assert.That(result.Count(), Is.EqualTo(0));
		}

		[Test]
		public async Task GetAllWaterfallsAsync_ShouldReturnAllWaterfalls()
		{
			var result = await _mountainService.GetAllWaterfallsAsync(1);

			Assert.That(result.Count(), Is.EqualTo(1));
		}

		[Test]
		public async Task GetAllWaterfallsAsync_ShouldReturnEmptyCollection()
		{
			var result = await _mountainService.GetAllWaterfallsAsync(2);

			Assert.That(result.Count(), Is.EqualTo(0));
		}

		[Test]
		public async Task GetAllRoutesAsync_ShouldReturnAllRoutes()
		{
			var result = await _mountainService.GetAllRoutesAsync(2);

			Assert.That(result.Count(), Is.EqualTo(1));
		}

		[Test]
		public async Task GetAllRoutesAsync_ShouldReturnEmptyCollection()
		{
			var result = await _mountainService.GetAllRoutesAsync(1);

			Assert.That(result.Count(), Is.EqualTo(0));
		}

		[Test]
		public async Task AddAsync_ShouldAddMountainToDb()
		{
			var mountainForm = new MountainFormViewModel()
			{
				Name = "Витоша",
				Location = "Витоша се намира между Стара планина и Рило-Родопския масив и е част от Средногорието. Тя е единствената куполообразна планина в България и основното и било се откроява добре от останалите планински масиви. То върви по върховете Черни връх, Резньовете, Скопарник и Острица, в посока северозапад-югоизток.",
				Climate = "Климатът на Витоша над 1800 м.н.в е типично планински, с голяма валежна сума 1250 mm. В най-ниските ѝ части годишното количество на валежите достига 700 mm, а в по-високите тази стойност надминава 1000 mm. На Черни връх валежите са 1050 mm. Твърдите валежи от сняг и град представляват над 50% от общото количество на годишните валежи. Средната януарска температура за планината е -4 \u00b0С, а на Черни връх е -8 \u00b0С. Летните температури също не са особено високи. Средната юлска температура е 13 \u00b0С, а на Черни връх 8 \u00b0С. Абсолютната максимална температура на Черни връх е +24 \u00b0С, а абсолютната минимална е -27,4 \u00b0С. Основни за планината са югозападните ветрове. Често ветровете в по-високите части достигат голяма скорост и вследствие тяхното действие остават обширни ветровали. По билото на Витоша средната годишна скорост на вятъра е над 10 m/s. Общото време на слънчевото греене е сравнително малко, като за средните части на планината то е 2400 h, а за Черни връх то е по-малко от 2000 h.",
				Waters = "Във Витоша има голям брой малки водни източници, но единствената голяма река, която извира от планината, е Струма. Тя тече на юг, като преминава през България и Гърция, и се влива в Бяло море.\r\n\r\nОстаналите реки във Витоша са: Рударщица, Палакария, Вълчи дол, Железнишка (Селска), Бистришка (Стара), Янчовска, Раковец, Шумако, Симеоновска, Скакавица, Боянска и Владайска, с притоците си Дамянова, Бистрата и Пладнешка.[2]\r\n\r\nНа територията на Витоша има и 6 подземни реки, в галериите на пещера Духлата, край село Боснек.",
				Fauna = "Едрите бозайници са малко. Това се дължи предимно на незаконния лов. Вследствие на това от тези животни са останали едва няколко вида – благороден елен, сърна, дива свиня, кафява мечка и вълк като и техния брой не е особено голям. Освен тези видове се срещат още водни земеровки, белокоремна белозъбка, обикновен заек, обикновен сънливец, лисица, видра и други. Установени са 236 вида птици, от които 120 гнездят на територията на Витоша.",
				Flora = "Горите заемат над 50% от цялата територия на планината, пасищата – 25%, а останалите площи са заети от скални масиви, каменни сипеи и площи, които поради релефни особености не могат да бъдат залесени.\r\n\r\nНа територията на Витоша са установени около 1500 вида висши растения, което е близо 50% от всички описани в България. Сред тях има 24 български и балкански ендемита и 52 вида включени в Червената книга на България.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Vitosha_seen_from_the_center_of_Sofia.jpg/250px-Vitosha_seen_from_the_center_of_Sofia.jpg"
			};

			await _mountainService.AddAsync(mountainForm);

			var allMountains = await _mountainService.GetAllMountains();

			Assert.That(allMountains.Count(), Is.EqualTo(3));

			var mountain = await _mountainService.DetailsAsync(3);

			Assert.That(mountain.Name, Is.EqualTo(mountainForm.Name));
			Assert.That(mountain.Location, Is.EqualTo(mountainForm.Location));
			Assert.That(mountain.Climate, Is.EqualTo(mountainForm.Climate));
			Assert.That(mountain.Waters, Is.EqualTo(mountainForm.Waters));
			Assert.That(mountain.Fauna, Is.EqualTo(mountainForm.Fauna));
			Assert.That(mountain.Flora, Is.EqualTo(mountainForm.Flora));
			Assert.That(mountain.ImageUrls, Is.EqualTo(mountainForm.ImageUrls));
		}

		[Test]
		public async Task CheckMountainExistsByNameAsync_ShouldReturnTrueIfMountainExists()
		{
			var result = await _mountainService.CheckMountainExistsByNameAsync("Рила");

			Assert.That(result, Is.True);
		}

		[Test]
		public async Task CheckMountainExistsByNameAsync_ShouldReturnFalseIfMountainDoesNotExist()
		{
			var result = await _mountainService.CheckMountainExistsByNameAsync("Витоша");

			Assert.That(result, Is.False);
		}

		[Test]
		public async Task CheckMountainExistsByIdAsync_ShouldReturnTrueIfMountainExists()
		{
			var result = await _mountainService.CheckMountainExistsByIdAsync(1);

			Assert.That(result, Is.True);
		}

		[Test]
		public async Task CheckMountainExistsByIdAsync_ShouldReturnFalseIfMountainDoesNotExist()
		{
			var result = await _mountainService.CheckMountainExistsByIdAsync(3);

			Assert.That(result, Is.False);
		}

		[Test]
		public async Task EditGetAsync_ShouldGetInformationAboutTheMountain()
		{
			var result = await _mountainService.EditGetAsync(1);
			var mountain = await _mountainService.DetailsAsync(1);

			Assert.That(result.Name, Is.EqualTo(mountain.Name));
			Assert.That(result.Location, Is.EqualTo(mountain.Location));
			Assert.That(result.Climate, Is.EqualTo(mountain.Climate));
			Assert.That(result.Waters, Is.EqualTo(mountain.Waters));
			Assert.That(result.Fauna, Is.EqualTo(mountain.Fauna));
			Assert.That(result.Flora, Is.EqualTo(mountain.Flora));
			Assert.That(result.ImageUrls, Is.EqualTo(mountain.ImageUrls));
		}

		[Test]
		public async Task EditPostAsync_ShouldEditMountainInformation()
		{
			var mountainForm = new MountainEditViewModel()
			{
				Id = 2,
				Name = "Пирин",
				Location = "Пирин е разположен в югозападната част на страната между долините на реките Струма и Места, между 41\u00b026' и 41\u00b056' северна ширина. На север граница с Рила е седловината Предел (1142 м), а на юг – Парилската седловина (1170 м), която отделя Пирин от планината Славянка. На североизток планината достига до долината на река Места с Разложката и Гоцеделчевската котловина и пролома Момина клисура, я отделят от Родопите. На запад и югозапад долината на река Струма със своите котловини Симитлийска и Петричко-Санданска и Кресненският пролом я отделят от планините Влахина, Малешевска и Огражден.Площта на планината е 2585 квадратни километра, т.е. тя е сравнително компактна, малка планина, което се потвърждава и от голямата ѝ средна височина – 1033 метра. Дължината ѝ по права линия от северозапад на югоизток е 66 км, а максималната ѝ широчина в направление югозапад-североизток е 40 километра – от град Сандански до село Обидим.",
				Climate = "Климатът в Пирин се отличава с голямо разнообразие, следствие от големите разлики в надморската височина, експозицията на склоновете, разчленението и подстилащата повърхнина. В по-ниските части и в долините на Струма и Места има силно средиземноморско влияние.\r\n\r\nНа север в района на Разложката котловина, разположена на ок. 940 м.н.в. е характерен умереноконтиненталния климат, дължащ се главно на голямата надморска височина на котловината. Средните януарски температури са ок. -2 \u00b0C, а валежите ок. 650 – 700 мм., като максимумът им е през ноември и вторичен – през юни. На юг в района на Гоцеделчевската котловина климатът е с преходносредиземноморски черти. Тук средногодишната температура достига 11,4 \u00b0C, а януарската е ок. 0 \u00b0C, валежите са предимно от дъжд със зимен максимум. Във високите части на планината климатът е типично планински. Средноянуарските температури варират от -1 до -2 \u00b0C в подножието и до -5 \u00b0C в по-високите части. Средната годишна температура на хижа „Вихрен“ е +3,5 \u00b0C. Количеството на валежите варира от 600 – 800 мм в по-ниските части до 1400 – 1500 мм в по-високите. Снежната покривка се задържа в по-високите части 7 – 8 месеца, а в Южен Пирин около 3 месеца. Често във високите части на планината през зимата се образуват опасни лавини.",
				Waters = "Пирин е много водна планина. Тя дава началото на голям брой реки, които принадлежат към водосборните басейни на Струма и Места. Те са сравнително къси, буйни и пълноводни, с голям наклон, поради което по тях се образуват множество водопади, прагове и бързеи. Има няколко по-изявени водопада – Влахинският водопад, Скоко, Попинолъшкият (15 м), Демянишки скок (11 м) и Юленски скок (9 м). Вододелът между водосборните басейни на Струма и Места минава по централното пиринско било. Пиринските реки имат снежно-дъждовен режим със силно изразен пролетен максимум. Най-голямото водно богатство на Пирин са красивите езера. На брой 186, те имат ледников произход, разположени са в малки и големи циркуси. Поради този си произход те са сравнително дълбоки, бистри, а поради височината – много студени. ",
				Flora = "Пирин е извънредно богат на растения и животни. Установени са около 1300 вида висши растения, което е 1/3 от всичките познати в България, 320 вида мъхове и няколкостотин вида водорасли. Висок е процентът на локалните ендемити – растения, които се срещат само в Пирин. Те са 18 на брой – пирински мак, пиринска ливадина, пиринска мащерка, давидов лопен и др. Много от растенията са редки и защитени, като например познатият на всички еделвайс, който се среща най-вече по Джамджиевите скали под Вихрен. Растителността е вертикално зонирана в три височинни пояса – горски, субалпийски и алпийски. Горският пояс е зает предимно от иглолистни дървета – бял и черен бор, бяла и черна мура, ела, обикновен смърч и достига приблизително до 2000 м. Оттам нагоре до 2500 м следва субалпийският пояс, в който доминират храстите клек и хвойна, чиито размери намаляват с увеличаването на височината. Накрая идва ред на алпийският пояс, зает от треви, лишеи и мъхове, а на границата между двата в изобилие се среща черната боровинка. По-особена е растителността край водните басейни, където най-често могат да се срещнат представителина рода на острицата. Най-известното дърво в Пирин е Байкушевата мура, носеща името на откривателя си, лесовъда Коста Байкушев. През 1897 година той изследва дървото с тръбна сонда и изчислява възрастта му на 1200 години. Приблизителните ѝ размери са височина 24 м, диаметър 2,2 м и обиколка 7,8 м.",
				Fauna = "Още по-голямо е богатството на животински видове. Познати са над 2000 вида и подвида безгръбначни животни (паяци, стоножки, насекоми, охлюви) и почти 250 вида гръбначни. От последните преобладават птиците (177 вида) и бозайниците (45 вида), а рибите са само 6 вида. Много от тези животни са застрашени и се нуждаят от специална защита – скален орел, трипръст кълвач, планински кефал, шипоопашата костенурка. Най-често могат да се срещнат дива коза, сърна, мечка, вълк, лисица, орел, сокол, глухар и др.",
				ImageUrls = "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR1Ro2y-lPLr76NQWdTRDFxieaWjbX6vzeLlQ",
			};


			await _mountainService.EditPostAsync(mountainForm);

			var mountain = await _mountainService.DetailsAsync(2);

			Assert.That(mountain.Id, Is.EqualTo(mountainForm.Id));
			Assert.That(mountain.Name, Is.EqualTo(mountainForm.Name));
			Assert.That(mountain.Location, Is.EqualTo(mountainForm.Location));
			Assert.That(mountain.Climate, Is.EqualTo(mountainForm.Climate));
			Assert.That(mountain.Waters, Is.EqualTo(mountainForm.Waters));
			Assert.That(mountain.Fauna, Is.EqualTo(mountainForm.Fauna));
			Assert.That(mountain.Flora, Is.EqualTo(mountainForm.Flora));
			Assert.That(mountain.ImageUrls, Is.EqualTo(mountainForm.ImageUrls));
		}
	}
}
