using Microsoft.EntityFrameworkCore;
using PeaksAndAdventures.Core.Interfaces;
using PeaksAndAdventures.Core.Models.ViewModels.Peak;
using PeaksAndAdventures.Core.Services;
using PeaksAndAdventures.Infrastructure.Data;
using PeaksAndAdventures.Infrastructure.Data.Common;
using PeaksAndAdventures.Infrastructure.Data.Enums.Route;
using PeaksAndAdventures.Infrastructure.Data.Models;

namespace PeaksAndAdventures.Tests
{
	[TestFixture]
	public class PeakServiceTests
	{
		private PeaksAndAdventuresDbContext dbContext;

		private IRepository repository;
		private IPeakService _peakService;

		private IEnumerable<Peak> peaks;
		private IEnumerable<Mountain> mountains;
		private IEnumerable<Route> routes;
		private IEnumerable<RoutePeak> routePeaks;


		[SetUp]
		public void Setup()
		{
			var options = new DbContextOptionsBuilder<PeaksAndAdventuresDbContext>()
				.UseInMemoryDatabase("PeaksAndAdventuresTest" + Guid.NewGuid().ToString())
				.Options;

			dbContext = new PeaksAndAdventuresDbContext(options);

			repository = new Repository(this.dbContext);
			_peakService = new PeakService(repository);

			this.peaks = new List<Peak>
			{
				new Peak
				{
					Id=1,
					Name = "Ботев",
					Altitude = 2376,
					Partition = "Средна Стара планина",
					SpecificLocation = "Калоферска планина, И от заслон Ботев",
					Description = "Връх Ботев е най-високият връх в Стара планина и с неговите 2375,9 м тя нарежда планината на 3-то място по височина в България, след Рила (връх Мусала – 2925 м) и Пирин (връх Вихрен – 2914 м). Намира се в Средна Стара планина, в Национален парк „Централен Балкан“. Разположението му в сърцето на страната и множеството туристически маршрути, които го опасват, го правят привлекателен за множество планинари. В подножието му се намира и най-високия водопад на Балканския полуостров – Райското пръскало. Той е основна атракция в местността със своите 124,5 м, което допълнително популяризира връх Ботев.",
					ImageUrl = "https://izbulgaria.com/wp-content/uploads/2021/07/gledka-kam-vrah-botev-1024x768.jpg",
					MountainId = 1
				},
				new Peak
				{
					Id = 2,
					Name = "Мусала",
					Altitude = 2925,
					Partition = "Източна Рила",
					Description = "Мусала е първенецът на Рила и най-високият планински връх в България и на целия Балкански полуостров. Надморската му височина е 2925,4 m, измерена от равнището на пристанище Варна. По-висок е с 8 m от следващия по височина връх на Балканите, Митикас в планината Олимп в Гърция, и с 11 m от първенеца на Пирин, връх Вихрен, който заема третото място в класацията. Мусала има относителна надморска височина от 2473 m, което го подрежда на 7-о място в Европа.",
					ImageUrl = "https://svetogled.com/wp-content/uploads/2021/08/DSC_0050_1.jpg",
					MountainId = 2
				},
				new Peak
				{
					Id = 3,
					Name = "Вихрен",
					Altitude = 2914,
					Partition = "Северен Пирин",
					Description = "Вѝхрен (до 29 юни 1942 г. Елтепе, Ел-тепе) е най-високият връх на Пирин. Със своите 2914 метра Вихрен е втори по височина в България след Мусала (2925,4) в Рила и трети на Балканския полуостров след Митикас (2917,727[3]) в Олимп. Гледан от Банско Вихрен прилича на пресечена пирамида, а от юг – на четиристенна пирамида. За този връх е характерно, че изглежда по много различен начин от различните посоки. Скалите, които изграждат Вихрен, са мрамори, които не задържат вода, поради което в целия район на върха няма реки и езера. Най-близките езера са Влахините на югозапад. Растителността по склоновете на Вихрен е бедна – трева и лишеи, докато животинският свят е по-богат – има птици, дребни гризачи, но най-вече диви кози, които обитават Казаните в подножието на върха. Цветето еделвайс се среща в изобилие по скалния ръб Джамджиеви скали.",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/07/MANE2800a.jpg",
					MountainId = 3
				},
			};

			this.mountains = new List<Mountain>
			{
				new Mountain
				{
					 Id = 1,
				Name = "Стара планина",
				Location = "Стара планина(Balkan Mountains) е една от четирите физиографични региона на Зона Стара планина. Тя е част от Алпийско-Хималайската планинска система, специфично в голямата геоложка формация, известна като Балкански планини. Разположена между Предбалкана на север и Долините на Подбалканските планини на юг, се простира на запад до река Търговище Тимок (десен приток на Бели Тимок) и река Височица (Комшица, Темска река, десен приток на Нишава) в Сърбия. На изток достига Черно море до мисия Емине.\r\n\r\nСтара планина обхваща части от 14 български области: Видин, Монтана, Враца, София, София-град, Ловеч, Пловдив, Габрово, Стара Загора, Велико Търново, Сливен, Шумен, Бургас и Варна.\r\n\r\nПлощта на Стара планина в България е 11 596,4 км\u00b2, с дължина от 530 км и ширина, варираща от 15 км в централната част до 50 км в западната и източната части. Средната й височина е 722 метра надморска височина.",
				Climate = "Климатът е умерено континентален, с изключение на източните части, които подлежат на переходни континентални влияния.\r\n\r\nОсновният планински хребет на Стара планина попада в зоната на планински климат. Основните фактори, които формират климата, са атмосферната циркулация, височината и изложението на склоновете.\r\n\r\nСтара планина служи като основна климатична бариера и природна граница в България. Северните подножия имат умерено континентални климатични характеристики, докато южните са переходни. Переходът в климата е особено характерен за източните части на планината. От подножието до върха се променят характерът и стойностите на климатичните елементи. Средната годишна температура намалява с височината, достигайки -0,7 \u00b0C на станцията на връх Ботев. Средните температури през януари варират широко, от около 0 \u00b0C в най-източните части до -5 \u00b0C за станцията Петрохан и -9,3 \u00b0C за станцията на връх Ботев. Средните температури през юли варират от 8 до 20 \u00b0C, в зависимост от височината. Амплитудите на температурата не са големи, вариращи от 16 до 18 \u00b0C.\r\n\r\nВалежите се увеличават с височината, достигайки 1200–1400 mm. Те са по-обилни на северните склонове, докато южните склонове остават в сянка от валежите, получавайки около 550 mm валежи. В източните части, поради переходния климат, валежите достигат около 600 mm. Задържането на сняг е около 4–6 седмици в по-високите райони и 1–2 седмици на изток. Максималните валежи се случват през пролетта, докато минимумът е през зимата, със сезонно изравняване на валежите в източните части. Най-вятърните места в България са върховете на Мургаш и Ботев, където средната годишна скорост на вятъра достига 10 м/с. Северните подножия на Стара планина се характеризират с фенови явления, докато регионът на Твърдица и Сливен изпитва студения спускащ се вятър, известен като \"бора\" (често наричан \"Сливенски вятър\"). Неблагоприятните климатични явления включват мъгла, инверсии на температурата в котловините и ледени условия.",
				Waters = "Стара планина дава начало на няколко значителни реки в България, сред които Лом, Огоста, Нишава, Малки Искър, Вит, Осъм, Видима, Росица, Янтра, Стряма, Тунджа, Луда Камчия и други. Значителна част от дренажа на реките в България се формира в този планински хребет. Реките проявяват характеристики на дъжд-сняг, сняг-дъжд, дъжд (особено в източната част) и карстово попълване (реките Нишава, Искрецка река, Котленска река, Лева река и др.). Високогорските райони достигат пик на оттичането през май, докато в по-ниски райони това се случва през април за северния склон и март за южния склон. В басейна на река Лудогорие максимумът е през февруари. Тук се намират и два тектонски езера: \"Локвата\" под Голям Купен в Централна Стара планина и Скаленското в Студовска планина.\r\n\r\nМодулът на оттичането в региона на Стара планина показва значително разнообразие. Той е по-висок в зоната с висока надморска височина на северните вятърни склонове (над 25 л/с/км\u00b2), където валежите са по-значителни, задържането на сняг е по-голямо, а изпарението е по-малко изразено. Освен това максималното оттичане е влияно от непропускливото геоложко основание и стръмния релеф. В по-ниската зона модулът на оттичането е значително по-малък (10 л/с/км\u00b2), където по-малките количества валежи, по-малкото задържане на сняг и по-силното изпарение значително намаляват магнитудата му. В най-ниските части на Стара планина модулът варира между 3 и 5 л/с/км\u00b2, а тези стойности се дължат на ниски количества валежи, значително изпарение, значителна инфилтрация в пропускливото геоложко основание и слабия наклон на релефа.\r\n\r\nСред резервоарите най-голямото е язовирът Камчия, построен на река Луда Камчия. Характеристиките на скалната композиция позволяват образуването на значителни количества на подпукнали подземни води. Развитите карстови процеси също са причина за многочислените карстови извори. Някои от най-големите карстови извори тук са Искрецките извори, Житолюб до станция Лакатник, извора Опицвет при подножието на Чепан и Мала планина, Котелските извори, докато най-известните минерални извори са във Вършец, Бурсия (Берковско), Нешковци (Троянско) и други.\r\n\r\nЗабележителни водопади включват Райнското пръскало (най-високият постоянен водопад на Балканския полуостров), Голям Джендемски водопад, Видимското, Кадемлийското, Бабското, Карловско пръскало и други. Вратенският водопад край Враца е най-големият прекъсваем водопад на Балканите.",
				Flora = " До около 800 m н.в. преобладават широколистните видове, предимно дъб и габър, над които е поясът на буковите гори. На много места именно букът формира горната граница на гората. Над буковите гори на отделни места се срещат хубави смърчови гори, на места смесени с ела (Берковска и Калоферска планина). Срещат се още ограничени площи на гори от бяла мура (Тетевенско) и черен бор. По северните склонове на Берковска Стара планина има естествени гори от реликтния обикновен кестен. В Средна Стара планина по карстови терени се среща еделвайсът (района на Козята стена и връх Мазалат).\r\n\r\nНай-високите части са заети от пасища и ливади. От храстовите видове са разпространени шипка, глог, къпина, дрян, леска, хвойна, боровинка, връшняк, трънка, драка, смрадлика, люляк и др. На отделни участъци в Средна и Западна Стара планина са запазени и храстови съобщества от клек. В района на Айтос е разпространен ендемитът айтоско сграбиче, а в централните части на планината се среща ендемитът старопланинска иглика. Западно от Сливен е и най-северното находище на средиземноморския вид кукуч. Значително е разнообразието на тревни видове:­ власатки, ливадина, детелина, светлика, острици, орлова папрат, картъл, полевица и др.",
				Fauna = "Главната старопланинска верига обитават представители на средноевропейската и евросибирската фауна –­ дива коза, благороден елен, сърна, мечка, катерица, вълк, лисица, заек, таралеж, от птиците –­ орел, алпийска гарга, кълвач, дрозд, от влечугите и земноводните –­ дъждовник, усойница, живораждащ гущер, зелен гущер, алпийски тритон и др. Някои животински видове от бръмбарите, пеперудите, скакалците, охлювите, пещерните животни са ендемити.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Triglav_massif%2C_Bulgaria.jpg/375px-Triglav_massif%2C_Bulgaria.jpg"
				},
				new Mountain
				{
					 Id = 2,
				Name = "Рила",
				Location = "Рѝла е най-високата планина в България и на Балканския полуостров. Намира се в югозападната част на страната, и по-точно в северозападния край на Рило-Родопския планински масив. Най-високият връх на планината – Мусала, със своите 2925,2 m е и най-високият на Балканския полуостров и цяла Източна Европа. По билото на Рила минава Главният български вододел, който съвпада с Главния балкански вододел, разделящ водосборните басейни на Черно и Егейско море.\r\n\r\nВ Европа Рила се нарежда на 6-о място по височина след планините: Кавказ (връх Елбрус – 5642 m), Алпите (връх Монблан – 4807 m), Сиера Невада (връх Муласен – 3479 m), Пиренеите (връх Ането – 3404 m) и Етна (3357 m). От планината извират едни от най-големите и пълноводни български реки – Искър, Марица и Места.",
				Climate = "Рила има типичен планински климат. На връх Мусала (2925 m) падат 2000 mm валежи годишно като 80% от тях са от сняг. Там са измерени най-ниските температури за планината – абсолютна минимална температура -31,2 \u00b0C при средна месечна температура -11,6 \u00b0C, измерена през февруари. Абсолютната максимална температура е 18,7 \u00b0C. Отрицателните температури се задържат средно около 9 месеца, като често продължават до края на юни. Устойчиво повишаване на температурата се наблюдава към средата и края на юли. Но дори и през летните месеци температурата не се задържа трайно над 10 \u00b0C. От 5 до 10 дни през юни, юли и август са със средна температура над 15 \u00b0C. Това определя краткия вегетационен период във високопланинските части. Той варира от 3 до 6 месеца, като над 2000 метра надморска височина трае около 3 месеца.\r\n\r\nВъв високите части на Рила относителната влажност на въздуха най-често е в границите от 80 до 85%. Най-сухи са студените, зимни месеци. Влажността е различна за северните и южни склонове на Рила. По южните склонове на планината валежите през зимата достигат до 22 – 25% от годишната норма, докато по северните склонове са занижени. По западните и северни склонове максимумът на валежите е през пролетта и лятото, а по източните склонове – през зимата.\r\n\r\n\r\nРавни чал\r\nТрайно формиране на снежна покривка в зоните непосредствено над 1000 m надморска височина се наблюдава след 10 – 15 декември – за северните склонове, а за южните – след 20 – 30 декември. Снежната покривка се задържа средно 200 – 220 дни в годината, като за ниската зона на планината тя е най-дебела през февруари. Тогава средната месечна дебелина достига 20 – 30 cm. Във високата зона – над 2000 m надморска височина – снежната покривка е най-дебела през март – 70 – 80 cm. В най-високите части максималната дебелина на снежната покривка достига 200 – 240 cm. Средната продължителност на периода с устойчива снежна покривка е 70 – 80 дни за надморска височина 1200 – 1300 m, а при надморска височина над 2000 m достига до 180 – 200 дни. Не са изключение ветрове със скорост 30 – 40 m/s (над 100 km/h), с предимно югозападна и западна ориентация. Северозападните и североизточните ветрове са по-умерени. Средната месечна скорост на вятъра по най-високите планински върхове достига 11 – 12 m/s. В по-ниските части средната месечна скорост се изменя от 1,2 до 2,5 m/s, а в средната височинна зона от 2,5 – 3,2 m/s. ",
				Waters = "Рила е важен хидроложки възел за България с изключително голям хидроенергиен потенциал, представляващ около 1/4 от целия потенциал на страната. Планината попада в хидроложката област с континентално климатично влияние, планинска подобласт. По северните ѝ склонове и връх Мусала минава главният вододел, разделящ двата отточни басейна – Черноморския и Беломорския (Егейски).Водните запаси, които се формират в границите на планината са най-важният ресурс на чиста питейна вода за околните селища, София, част от населението на Северна Гърция и европейската част на Турция. Районът на населените места, разположени по западните склонове на Рила планина разполага с голям излишък от вода, тъй като оттокът надвишава потреблението около 8 пъти. Режимът на рилските реки е в пряка връзка с надморската височина и около половината от водните запаси в планината се намират на височина над 2050 m. От планината извират едни от най-пълноводните и дълги реки на Балканите – Искър, Марица и Места. Изворите на много притоци на тези реки, както и на притоци на Струма, също се намират във високопланинските части на Рила – Бели, Леви, Прав и Черни Искър, Бяла и Черна Места, реките Белишка, Благоевградска Бистрица, Градевска, Рилска. На територията на планината се формират около 10% от водните ресурси на Струма и Места, над 5% от тези на р. Марица и повече от 8% на р. Искър. Поради екзарационната дейност на ледниците през кватернера във високопланинските части на Рила са се образували голям брой ледникови езера. От тях по-голямата част са постоянни, около 35 са временни и за всички са характерни малките площ и обем. Обикновено заемат дъната на циркусите, циркусните тераси и троговите долини и са разположени на надморска височина между 2000 и 2600 m. Най-често имат закръглена или елипсовидна форма с малки дължина и ширина, като повечето са с площ под 10 дка. Тези води имат значение не толкова с количеството си, отколкото със своето качество и красотата на езерата, която привлича ежегодно хиляди туристи. Веригата на Седемте рилски езера е най-дългата, най-живописна и най-посещавана езерна група. В Рила са описани около 233 езера, от които 189 циркусни, а останалите имат тектонски или свлачищен произход.",
				Flora = "В Рила растат:\r\n\r\nдървета – обикновен габър (Carpinus betulus), зимен дъб (Quercus petraea), обикновен бук (Fagus sylvatica), трепетлика (Populus tremula), бреза (Betula pendula), обикновена ела (Abies alba), бяла мура (Pinus peuce), обикновен смърч (Picea abies), бял бор (Pinus sylvestris) покриват планинските склонове между 1600 до 2000 m.\r\nцветя – алпийска камбанка (Campanula alpina), планинско омайниче (Dryas octopetala), пролетна съсънка (Pulsatilla vernalis), иглика.",
				Fauna = "Общо 24 вида от срещащите се в Рила животни са вписани в Световната Червена книга. Гръбначните животни са 172 вида като 121 от тях са вписани в Българската Червена книга, 15 вида – в европейската Червена книга, 24 вида – в червения списък на Международния съюз за защита на природата (IUCN), а 158 – в списъците към Бернската конвенция.\r\n\r\nБезгръбначни\r\nВ Рила се срещат 2934 вида безгръбначни животни, като 242 са ендемични видове и подвидове. Общо 13 вида от безгръбначните животни живеещи тук са застрашени от изчезване в световен мащаб, а 41 вида са включени в световни и европейски списъци на застрашени видове.[38]\r\n\r\nРиби\r\nВ Рила се срещат 5 вида риби. Различни източници сочат, че видовото разнообразие на рибите достига до 18 като 4 от тях са балкански ендемити.[39] Дъговата и балканската пъстърва обитава езерата и язовирите и по-рядко реките Марица, Ибър, Крива река, Джерман. В рилските езера е широко разпространена лешанката. Видът е интродуциран за стръв от рибари. Някои от езерата са зарибени със сивен. Главочът се среща по-рядко, основно в река Черни Искър.\r\n\r\nЕндемитните видове в Рила са български – главоч (Cottus gobio haemusi) и струмски гулеш (Nemacheilus angorae bureschi) и балкански – маришка мряна (Barbus cyclolepis) и балкански щипок (Sabanejewia aurata balcanica).\r\n\r\nЗемноводни и влечуги\r\nПланината е обитавана от 20 вида земноводни и влечуги. Сред видовете, които се срещат в най-високите части на планината са планинска водна жаба, алпийски тритон, слепок, живороден гущер, ливаден гущер, усойница и медянка. От тях ендемичен вид е македонският гущер.\r\n\r\nПтици\r\nПтиците са представени от 99 вида (около 25% от орнитофауната на България) като тук са най-многобройните популации на глухара, лещарката и планинския кеклик, на пернатоногата и малката кукумявка. Тук се намират и едни от най-жизнените популации на хищни птици. От вписаните в Червената книга птици тук се срещат осояд, скален орел, горски бекас, белогръб кълвач, черен кълвач, малък креслив орел, сокол орко, голям ястреб, орел змияр, ловен сокол и други. Девет вида птици са престанали да гнездят тук.[40]\r\n\r\nБозайници\r\n\r\nЛешников сънливец\r\nБозайниците в Рила са 48 вида като тук е характерна популацията на дивата коза и високопланинската популация на лалугера.[38] Прилепите в Рила са десет, а дребните бозайници се подразделат на насекомоядни, зайци и гризачи. От тях са интересни таралежът, лешниковият сънливец и сляпото куче. Лалугерът е световно застрашен вид. Стабилна, но изолирана високопланинска колония от лалугери е установена в района на връх Белмекен. От по-едрите представители на бозайниците подвидовете на невестулката (Mustela nivalis galinthias) и дивата коза (Rupicapra rupicapra balcanica) са балкански ендемити.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Maliovitsa_District_Rila.jpg/1280px-Maliovitsa_District_Rila.jpg"
				},
				new Mountain
				{
					 Id = 3,
				Name = "Пирин",
				Location = "Пирин е разположен в югозападната част на страната между долините на реките Струма и Места, между 41\u00b026' и 41\u00b056' северна ширина. На север граница с Рила е седловината Предел (1142 м), а на юг – Парилската седловина (1170 м), която отделя Пирин от планината Славянка. На североизток планината достига до долината на река Места с Разложката и Гоцеделчевската котловина и пролома Момина клисура, я отделят от Родопите. На запад и югозапад долината на река Струма със своите котловини Симитлийска и Петричко-Санданска и Кресненският пролом я отделят от планините Влахина, Малешевска и Огражден.\r\n\r\nПлощта на планината е 2585 квадратни километра, т.е. тя е сравнително компактна, малка планина, което се потвърждава и от голямата ѝ средна височина – 1033 метра. Дължината ѝ по права линия от северозапад на югоизток е 66 км, а максималната ѝ широчина в направление югозапад-североизток е 40 километра – от град Сандански до село Обидим.",
				Climate = "Климатът в Пирин се отличава с голямо разнообразие, следствие от големите разлики в надморската височина, експозицията на склоновете, разчленението и подстилащата повърхнина. В по-ниските части и в долините на Струма и Места има силно средиземноморско влияние.\r\n\r\nНа север в района на Разложката котловина, разположена на ок. 940 м.н.в. е характерен умереноконтиненталния климат, дължащ се главно на голямата надморска височина на котловината. Средните януарски температури са ок. -2 \u00b0C, а валежите ок. 650 – 700 мм., като максимумът им е през ноември и вторичен – през юни. На юг в района на Гоцеделчевската котловина климатът е с преходносредиземноморски черти. Тук средногодишната температура достига 11,4 \u00b0C, а януарската е ок. 0 \u00b0C, валежите са предимно от дъжд със зимен максимум. Във високите части на планината климатът е типично планински. Средноянуарските температури варират от -1 до -2 \u00b0C в подножието и до -5 \u00b0C в по-високите части. Средната годишна температура на хижа „Вихрен“ е +3,5 \u00b0C. Количеството на валежите варира от 600 – 800 мм в по-ниските части до 1400 – 1500 мм в по-високите. Снежната покривка се задържа в по-високите части 7 – 8 месеца, а в Южен Пирин около 3 месеца. Често във високите части на планината през зимата се образуват опасни лавини.",
				Waters = "Пирин е много водна планина. Тя дава началото на голям брой реки, които принадлежат към водосборните басейни на Струма и Места. Те са сравнително къси, буйни и пълноводни, с голям наклон, поради което по тях се образуват множество водопади, прагове и бързеи. Има няколко по-изявени водопада – Влахинският водопад, Скоко, Попинолъшкият (15 м), Демянишки скок (11 м) и Юленски скок (9 м). Вододелът между водосборните басейни на Струма и Места минава по централното пиринско било. Пиринските реки имат снежно-дъждовен режим със силно изразен пролетен максимум. Най-голямото водно богатство на Пирин са красивите езера. На брой 186, те имат ледников произход, разположени са в малки и големи циркуси. Поради този си произход те са сравнително дълбоки, бистри, а поради височината – много студени. ",
				Flora = "Пирин е извънредно богат на растения и животни. Установени са около 1300 вида висши растения, което е 1/3 от всичките познати в България, 320 вида мъхове и няколкостотин вида водорасли. Висок е процентът на локалните ендемити – растения, които се срещат само в Пирин. Те са 18 на брой – пирински мак, пиринска ливадина, пиринска мащерка, давидов лопен и др. Много от растенията са редки и защитени, като например познатият на всички еделвайс, който се среща най-вече по Джамджиевите скали под Вихрен. Растителността е вертикално зонирана в три височинни пояса – горски, субалпийски и алпийски. Горският пояс е зает предимно от иглолистни дървета – бял и черен бор, бяла и черна мура, ела, обикновен смърч и достига приблизително до 2000 м. Оттам нагоре до 2500 м следва субалпийският пояс, в който доминират храстите клек и хвойна, чиито размери намаляват с увеличаването на височината. Накрая идва ред на алпийският пояс, зает от треви, лишеи и мъхове, а на границата между двата в изобилие се среща черната боровинка. По-особена е растителността край водните басейни, където най-често могат да се срещнат представителина рода на острицата. Най-известното дърво в Пирин е Байкушевата мура, носеща името на откривателя си, лесовъда Коста Байкушев. През 1897 година той изследва дървото с тръбна сонда и изчислява възрастта му на 1200 години. Приблизителните ѝ размери са височина 24 м, диаметър 2,2 м и обиколка 7,8 м.",
				Fauna = "Още по-голямо е богатството на животински видове. Познати са над 2000 вида и подвида безгръбначни животни (паяци, стоножки, насекоми, охлюви) и почти 250 вида гръбначни. От последните преобладават птиците (177 вида) и бозайниците (45 вида), а рибите са само 6 вида. Много от тези животни са застрашени и се нуждаят от специална защита – скален орел, трипръст кълвач, планински кефал, шипоопашата костенурка. Най-често могат да се срещнат дива коза, сърна, мечка, вълк, лисица, орел, сокол, глухар и др.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Pogled_kum_prez_gr_Petrich_kum_gr_Sandanski.jpg/1280px-Pogled_kum_prez_gr_Petrich_kum_gr_Sandanski.jpg",
				},
			};

			this.routes = new List<Route>
			{
				new Route
				{
					 Id = 1,
				Name = "Връх Мусала – най-високият връх в България и на Балканите",
				StartingPoint = "Хижа Ястребец",
				Description = "Хижа „Ястребец“ – хижа „Мусала“\r\nОт лифта тръгнете по главната пътека към хижата. Пътеката е почти равна и широка. Най-вероятно ще видите много хора и трудно бихте се объркали. Маршрута до хижата отнема около час, а маркировката, която трябва да следвате е червена. Повече информация може да прочетете в статията ни за хижа „Мусала.\r\n\r\nВръх Иречек вляво и връх Мусала вдясно, отпред Мусаленското езеро\r\nХижа „Мусала“ – Ледено езеро\r\nСлед като стигнете хижа „Мусала“ ви остават около 2 часа преход до върха. До хижата се намират първите три езера от езерната група Мусаленски езера. Тръгнете по дясната страна на езерото пред хижа „Мусала“. От тук започва постепенно изкачване, пътеката става все по-камениста и все по-често се върви по морени. По пътеката ще минете покрай две езера, първото от които е Алековото езеро. След около 30-35 минути ще достигнете до Леденото езеро.\r\n\r\n\r\nЛедено езеро – връх Мусала\r\nСега е моментът да си отдъхнете преди последното изкачване. То е най-трудно и изморително заради голямата денивелация. Тук е и единствената чешма по пътя.\r\n\r\n\r\n\r\nИма две пътеки – лятна и зимна. Зимната е камениста и стръмна, но има обезопасително метално въже.\r\n\r\n\r\nЗа по-неопитните туристи е препоръчително да изберат лятната пътека. След около половин час нагоре ще стигнете най-високата точка на България.\r\n\r\nГледка от връх Мусала към Леденото езеро\r\n\r\nПред вас ще се открие уникална гледка към върхове и езера. На юг са Маричините езера, на север – Ледено езеро и местността, от която дойдохте, на изток – върховете Малка Мусала (2902 м) и Иречек (2852 м). При ясно време можете да видите в далечината на запад връх Мальовица.",
				Difficulty = Difficulty.Moderate,
				DisplacementNegative = 104,
				DisplacementPositive = 684,
				Duration = "0.05:00",
				ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSC6986-1024x680.webp",
				MountainId = 2
				},
			};

			this.routePeaks = new List<RoutePeak>
			{
				new RoutePeak { RouteId = 1, PeakId = 2 },
			};

			this.dbContext.AddRange(this.peaks);
			this.dbContext.AddRange(this.mountains);
			this.dbContext.AddRange(this.routes);
			this.dbContext.AddRange(this.routePeaks);
			this.dbContext.SaveChanges();
		}

		[TearDown]
		public async Task Cleanup()
		{
			await this.dbContext.Database.EnsureDeletedAsync();
			await this.dbContext.DisposeAsync();
		}

		[Test]
		public async Task All_ShouldReturnAllPeaks()
		{
			var result = await _peakService.AllAsync();

			Assert.That(result.Count(), Is.EqualTo(3));
		}

		[Test]
		public async Task AllPagination_ShouldReturnAllPeaks()
		{
			int page = 1;
			int pageSize = 10;

			var result = await _peakService.AllPaginationAsync(page, pageSize);

			Assert.That(result.Peaks.Count(), Is.EqualTo(3));
			Assert.That(result.TotalPages, Is.EqualTo(1));
		}

		[Test]
		public async Task AddPeakToMountain_ShouldAddPeakToMountain()
		{
			var peakForm = new PeakAddViewModel
			{
				Name = "Мальовица",
				Altitude = 2729,
				Partition = "Северозападна Рила",
				SpecificLocation = "СЗ от Еленино езеро",
				Description = "Мальовица е името на връх в северозападната част на планина Рила, висок 2729 m. Името на върха е свързано с Мальо войвода – борец срещу поробителите, загинал според преданието нейде в Мальовишката долина. Друго предположение е, че името произлиза от Малите езера, както планинците наричат езерата в североизточното подножие на върха. На най-старите карти върхът е отбелязан с името Малевица. По труднодостъпните северни и източни склонове на връх Мальовица се намират едни от най-посещаваните от алпинисти скални стени в България. Северната отвесна стена на Мальовица е висока 124 метра и е символ в българския алпинизъм.",
				ImageUrl = "https://www.standartnews.com/media/1/2023/10/14/388220/960x540.jpg?timer=1697268969",
				MountainId = 2
			};

			await _peakService.AddPeakToMountainAsync(peakForm);

			var allPeaks = await _peakService.AllAsync();

			Assert.That(allPeaks.Count(), Is.EqualTo(4));

			var result = this.dbContext.Peaks.FirstOrDefault(p => p.Name == "Мальовица");

			Assert.IsNotNull(result);
			Assert.That(result.Altitude, Is.EqualTo(peakForm.Altitude));
			Assert.That(result.Partition, Is.EqualTo(peakForm.Partition));
			Assert.That(result.SpecificLocation, Is.EqualTo(peakForm.SpecificLocation));
			Assert.That(result.Name, Is.EqualTo(peakForm.Name));
			Assert.That(result.Description, Is.EqualTo(peakForm.Description));
			Assert.That(result.ImageUrl, Is.EqualTo(peakForm.ImageUrl));
			Assert.That(result.MountainId, Is.EqualTo(peakForm.MountainId));
		}

		[Test]
		public async Task CheckPeakExistByIdAsync_ShouldReturnTrue()
		{
			var result = await _peakService.CheckPeakExistsByIdAsync(1);

			Assert.That(result, Is.True);
		}

		[Test]
		public async Task CheckPeakExistByIdAsync_ShouldReturnFalse()
		{
			var result = await _peakService.CheckPeakExistsByIdAsync(4);

			Assert.That(result, Is.False);
		}

		[Test]
		public async Task CheckPeakExistByNameAsync_ShouldReturnTrue()
		{
			var result = await _peakService.CheckPeakExistsByNameAsync("Ботев");

			Assert.That(result, Is.True);
		}

		[Test]
		public async Task CheckPeakExistByNameAsync_ShouldReturnFalse()
		{
			var result = await _peakService.CheckPeakExistsByNameAsync("Мальовица");

			Assert.That(result, Is.False);
		}

		[Test]
		public async Task DeleteGet_ShouldReturnCorrectPeakDeleteViewModel()
		{
			var result = await _peakService.DeleteGetAsync(2);

			Assert.That(result.Id, Is.EqualTo(2));
			Assert.That(result.Name, Is.EqualTo("Мусала"));
			Assert.That(result.MountainName, Is.EqualTo("Рила"));
		}

		[Test]
		public async Task DeleteConfirmed_ShouldDeletePeak()
		{
			var peakId = 1;

			await _peakService.DeleteConfirmedAsync(peakId);

			var result = this.dbContext.Peaks.FirstOrDefault(p => p.Id == peakId);

			Assert.IsNull(result);
		}

		[Test]
		public async Task DeleteConfirmed_ShouldDeletePeakWithRouteToHim()
		{
			var peakId = 2;

			await _peakService.DeleteConfirmedAsync(peakId);

			var result = this.dbContext.Peaks.FirstOrDefault(p => p.Id == peakId);

			Assert.IsNull(result);
		}

		[Test]
		public async Task Details_ShouldReturnCorrectPeakDetailsViewModel()
		{
			var result = await _peakService.DetailsAsync(2);

			Assert.That(result.Id, Is.EqualTo(2));
			Assert.That(result.Name, Is.EqualTo("Мусала"));
			Assert.That(result.Altitude, Is.EqualTo(2925));
			Assert.That(result.Partition, Is.EqualTo("Източна Рила"));
			Assert.That(result.SpecificLocation, Is.EqualTo(null));
			Assert.That(result.Description,
				Is.EqualTo(
					"Мусала е първенецът на Рила и най-високият планински връх в България и на целия Балкански полуостров. Надморската му височина е 2925,4 m, измерена от равнището на пристанище Варна. По-висок е с 8 m от следващия по височина връх на Балканите, Митикас в планината Олимп в Гърция, и с 11 m от първенеца на Пирин, връх Вихрен, който заема третото място в класацията. Мусала има относителна надморска височина от 2473 m, което го подрежда на 7-о място в Европа."));
		}

		[Test]
		public async Task EditGet_ShouldReturnCorrectPeakEditViewModel()
		{
			var result = await _peakService.EditGetAsync(2);

			Assert.That(result.Id, Is.EqualTo(2));
			Assert.That(result.Name, Is.EqualTo("Мусала"));
			Assert.That(result.Altitude, Is.EqualTo(2925));
			Assert.That(result.Partition, Is.EqualTo("Източна Рила"));
			Assert.That(result.SpecificLocation, Is.EqualTo(null));
			Assert.That(result.Description,
				Is.EqualTo(
					"Мусала е първенецът на Рила и най-високият планински връх в България и на целия Балкански полуостров. Надморската му височина е 2925,4 m, измерена от равнището на пристанище Варна. По-висок е с 8 m от следващия по височина връх на Балканите, Митикас в планината Олимп в Гърция, и с 11 m от първенеца на Пирин, връх Вихрен, който заема третото място в класацията. Мусала има относителна надморска височина от 2473 m, което го подрежда на 7-о място в Европа."));
		}

		[Test]
		public async Task EditPost_ShouldEditPeak()
		{
			var peakForm = new PeakEditViewModel
			{
				Id = 2,
				Name = "Мусала",
				Altitude = 2925,
				Partition = "Източна Рила",
				SpecificLocation = "на около 80 km от София",
				Description = "Мусала е първенецът на Рила и най-високият планински връх в България и на целия Балкански полуостров. Надморската му височина е 2925,4 m, измерена от равнището на пристанище Варна. По-висок е с 8 m от следващия по височина връх на Балканите, Митикас в планината Олимп в Гърция, и с 11 m от първенеца на Пирин, връх Вихрен, който заема третото място в класацията. Мусала има относителна надморска височина от 2473 m, което го подрежда на 7-о място в Европа.",
				ImageUrl = "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Musala_peak.jpg/1280px-Musala_peak.jpg",
			};

			var updatedPeak = await _peakService.EditPostAsync(peakForm);
			var peakCheck = await _peakService.EditGetAsync(updatedPeak);

			Assert.IsNotNull(peakCheck);
			Assert.That(peakCheck.Altitude, Is.EqualTo(peakForm.Altitude));
			Assert.That(peakCheck.Partition, Is.EqualTo(peakForm.Partition));
			Assert.That(peakCheck.SpecificLocation, Is.EqualTo(peakForm.SpecificLocation));
			Assert.That(peakCheck.Name, Is.EqualTo(peakForm.Name));
			Assert.That(peakCheck.Description, Is.EqualTo(peakForm.Description));
			Assert.That(peakCheck.ImageUrl, Is.EqualTo(peakForm.ImageUrl));
		}

		[Test]
		public async Task GetRoutesToPeak_ShouldReturnAllRoutesToPeak()
		{
			var result = await _peakService.GetRoutesToPeakAsync(2);

			Assert.That(result.Count(), Is.EqualTo(1));
		}

		[Test]
		public async Task GetRoutesToPeak_ShouldReturnEmptyCollection()
		{
			var result = await _peakService.GetRoutesToPeakAsync(3);

			Assert.That(result.Count(), Is.EqualTo(0));
		}
	}
}
