using Microsoft.EntityFrameworkCore;
using PeaksAndAdventures.Core.Interfaces;
using PeaksAndAdventures.Core.Models.ViewModels.Route;
using PeaksAndAdventures.Core.Services;
using PeaksAndAdventures.Infrastructure.Data;
using PeaksAndAdventures.Infrastructure.Data.Common;
using PeaksAndAdventures.Infrastructure.Data.Enums.Hut;
using PeaksAndAdventures.Infrastructure.Data.Enums.Route;
using PeaksAndAdventures.Infrastructure.Data.Models;

namespace PeaksAndAdventures.Tests
{
	[TestFixture]
	public class RouteServiceTests
	{
		private PeaksAndAdventuresDbContext _context;

		private IRepository _repository;
		private IRouteService _routeService;

		private IEnumerable<Mountain> _mountains;
		private IEnumerable<Route> _routes;
		private IEnumerable<Peak> _peaks;
		private IEnumerable<Hut> _huts;
		private IEnumerable<Lake> _lakes;
		private IEnumerable<Waterfall> _waterfalls;

		private IEnumerable<RoutePeak> _routePeaks;
		private IEnumerable<RouteHut> _routeHuts;
		private IEnumerable<RouteLake> _routeLakes;
		private IEnumerable<RouteWaterfall> _routeWaterfalls;


		[SetUp]
		public void Setup()
		{
			var options = new DbContextOptionsBuilder<PeaksAndAdventuresDbContext>()
				.UseInMemoryDatabase(databaseName: "PeaksAndAdventuresTest" + Guid.NewGuid().ToString())
				.Options;

			_context = new PeaksAndAdventuresDbContext(options);

			_repository = new Repository(_context);
			_routeService = new RouteService(_repository);

			_mountains = new List<Mountain>()
			{
				new Mountain
				{
					 Id = 1,
				Name = "Стара планина",
				Location = "Стара планина(Balkan Mountains) е една от четирите физиографични региона на Зона Стара планина. Тя е част от Алпийско-Хималайската планинска система, специфично в голямата геоложка формация, известна като Балкански планини. Разположена между Предбалкана на север и Долините на Подбалканските планини на юг, се простира на запад до река Търговище Тимок (десен приток на Бели Тимок) и река Височица (Комшица, Темска река, десен приток на Нишава) в Сърбия. На изток достига Черно море до мисия Емине.\r\n\r\nСтара планина обхваща части от 14 български области: Видин, Монтана, Враца, София, София-град, Ловеч, Пловдив, Габрово, Стара Загора, Велико Търново, Сливен, Шумен, Бургас и Варна.\r\n\r\nПлощта на Стара планина в България е 11 596,4 км\u00b2, с дължина от 530 км и ширина, варираща от 15 км в централната част до 50 км в западната и източната части. Средната й височина е 722 метра надморска височина.",
				Climate = "Климатът е умерено континентален, с изключение на източните части, които подлежат на переходни континентални влияния.\r\n\r\nОсновният планински хребет на Стара планина попада в зоната на планински климат. Основните фактори, които формират климата, са атмосферната циркулация, височината и изложението на склоновете.\r\n\r\nСтара планина служи като основна климатична бариера и природна граница в България. Северните подножия имат умерено континентални климатични характеристики, докато южните са переходни. Переходът в климата е особено характерен за източните части на планината. От подножието до върха се променят характерът и стойностите на климатичните елементи. Средната годишна температура намалява с височината, достигайки -0,7 \u00b0C на станцията на връх Ботев. Средните температури през януари варират широко, от около 0 \u00b0C в най-източните части до -5 \u00b0C за станцията Петрохан и -9,3 \u00b0C за станцията на връх Ботев. Средните температури през юли варират от 8 до 20 \u00b0C, в зависимост от височината. Амплитудите на температурата не са големи, вариращи от 16 до 18 \u00b0C.\r\n\r\nВалежите се увеличават с височината, достигайки 1200–1400 mm. Те са по-обилни на северните склонове, докато южните склонове остават в сянка от валежите, получавайки около 550 mm валежи. В източните части, поради переходния климат, валежите достигат около 600 mm. Задържането на сняг е около 4–6 седмици в по-високите райони и 1–2 седмици на изток. Максималните валежи се случват през пролетта, докато минимумът е през зимата, със сезонно изравняване на валежите в източните части. Най-вятърните места в България са върховете на Мургаш и Ботев, където средната годишна скорост на вятъра достига 10 м/с. Северните подножия на Стара планина се характеризират с фенови явления, докато регионът на Твърдица и Сливен изпитва студения спускащ се вятър, известен като \"бора\" (често наричан \"Сливенски вятър\"). Неблагоприятните климатични явления включват мъгла, инверсии на температурата в котловините и ледени условия.",
				Waters = "Стара планина дава начало на няколко значителни реки в България, сред които Лом, Огоста, Нишава, Малки Искър, Вит, Осъм, Видима, Росица, Янтра, Стряма, Тунджа, Луда Камчия и други. Значителна част от дренажа на реките в България се формира в този планински хребет. Реките проявяват характеристики на дъжд-сняг, сняг-дъжд, дъжд (особено в източната част) и карстово попълване (реките Нишава, Искрецка река, Котленска река, Лева река и др.). Високогорските райони достигат пик на оттичането през май, докато в по-ниски райони това се случва през април за северния склон и март за южния склон. В басейна на река Лудогорие максимумът е през февруари. Тук се намират и два тектонски езера: \"Локвата\" под Голям Купен в Централна Стара планина и Скаленското в Студовска планина.\r\n\r\nМодулът на оттичането в региона на Стара планина показва значително разнообразие. Той е по-висок в зоната с висока надморска височина на северните вятърни склонове (над 25 л/с/км\u00b2), където валежите са по-значителни, задържането на сняг е по-голямо, а изпарението е по-малко изразено. Освен това максималното оттичане е влияно от непропускливото геоложко основание и стръмния релеф. В по-ниската зона модулът на оттичането е значително по-малък (10 л/с/км\u00b2), където по-малките количества валежи, по-малкото задържане на сняг и по-силното изпарение значително намаляват магнитудата му. В най-ниските части на Стара планина модулът варира между 3 и 5 л/с/км\u00b2, а тези стойности се дължат на ниски количества валежи, значително изпарение, значителна инфилтрация в пропускливото геоложко основание и слабия наклон на релефа.\r\n\r\nСред резервоарите най-голямото е язовирът Камчия, построен на река Луда Камчия. Характеристиките на скалната композиция позволяват образуването на значителни количества на подпукнали подземни води. Развитите карстови процеси също са причина за многочислените карстови извори. Някои от най-големите карстови извори тук са Искрецките извори, Житолюб до станция Лакатник, извора Опицвет при подножието на Чепан и Мала планина, Котелските извори, докато най-известните минерални извори са във Вършец, Бурсия (Берковско), Нешковци (Троянско) и други.\r\n\r\nЗабележителни водопади включват Райнското пръскало (най-високият постоянен водопад на Балканския полуостров), Голям Джендемски водопад, Видимското, Кадемлийското, Бабското, Карловско пръскало и други. Вратенският водопад край Враца е най-големият прекъсваем водопад на Балканите.",
				Flora = " До около 800 m н.в. преобладават широколистните видове, предимно дъб и габър, над които е поясът на буковите гори. На много места именно букът формира горната граница на гората. Над буковите гори на отделни места се срещат хубави смърчови гори, на места смесени с ела (Берковска и Калоферска планина). Срещат се още ограничени площи на гори от бяла мура (Тетевенско) и черен бор. По северните склонове на Берковска Стара планина има естествени гори от реликтния обикновен кестен. В Средна Стара планина по карстови терени се среща еделвайсът (района на Козята стена и връх Мазалат).\r\n\r\nНай-високите части са заети от пасища и ливади. От храстовите видове са разпространени шипка, глог, къпина, дрян, леска, хвойна, боровинка, връшняк, трънка, драка, смрадлика, люляк и др. На отделни участъци в Средна и Западна Стара планина са запазени и храстови съобщества от клек. В района на Айтос е разпространен ендемитът айтоско сграбиче, а в централните части на планината се среща ендемитът старопланинска иглика. Западно от Сливен е и най-северното находище на средиземноморския вид кукуч. Значително е разнообразието на тревни видове:­ власатки, ливадина, детелина, светлика, острици, орлова папрат, картъл, полевица и др.",
				Fauna = "Главната старопланинска верига обитават представители на средноевропейската и евросибирската фауна –­ дива коза, благороден елен, сърна, мечка, катерица, вълк, лисица, заек, таралеж, от птиците –­ орел, алпийска гарга, кълвач, дрозд, от влечугите и земноводните –­ дъждовник, усойница, живораждащ гущер, зелен гущер, алпийски тритон и др. Някои животински видове от бръмбарите, пеперудите, скакалците, охлювите, пещерните животни са ендемити.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Triglav_massif%2C_Bulgaria.jpg/375px-Triglav_massif%2C_Bulgaria.jpg"
				},
				new Mountain
				{
					 Id = 2,
				Name = "Рила",
				Location = "Рѝла е най-високата планина в България и на Балканския полуостров. Намира се в югозападната част на страната, и по-точно в северозападния край на Рило-Родопския планински масив. Най-високият връх на планината – Мусала, със своите 2925,2 m е и най-високият на Балканския полуостров и цяла Източна Европа. По билото на Рила минава Главният български вододел, който съвпада с Главния балкански вододел, разделящ водосборните басейни на Черно и Егейско море.\r\n\r\nВ Европа Рила се нарежда на 6-о място по височина след планините: Кавказ (връх Елбрус – 5642 m), Алпите (връх Монблан – 4807 m), Сиера Невада (връх Муласен – 3479 m), Пиренеите (връх Ането – 3404 m) и Етна (3357 m). От планината извират едни от най-големите и пълноводни български реки – Искър, Марица и Места.",
				Climate = "Рила има типичен планински климат. На връх Мусала (2925 m) падат 2000 mm валежи годишно като 80% от тях са от сняг. Там са измерени най-ниските температури за планината – абсолютна минимална температура -31,2 \u00b0C при средна месечна температура -11,6 \u00b0C, измерена през февруари. Абсолютната максимална температура е 18,7 \u00b0C. Отрицателните температури се задържат средно около 9 месеца, като често продължават до края на юни. Устойчиво повишаване на температурата се наблюдава към средата и края на юли. Но дори и през летните месеци температурата не се задържа трайно над 10 \u00b0C. От 5 до 10 дни през юни, юли и август са със средна температура над 15 \u00b0C. Това определя краткия вегетационен период във високопланинските части. Той варира от 3 до 6 месеца, като над 2000 метра надморска височина трае около 3 месеца.\r\n\r\nВъв високите части на Рила относителната влажност на въздуха най-често е в границите от 80 до 85%. Най-сухи са студените, зимни месеци. Влажността е различна за северните и южни склонове на Рила. По южните склонове на планината валежите през зимата достигат до 22 – 25% от годишната норма, докато по северните склонове са занижени. По западните и северни склонове максимумът на валежите е през пролетта и лятото, а по източните склонове – през зимата.\r\n\r\n\r\nРавни чал\r\nТрайно формиране на снежна покривка в зоните непосредствено над 1000 m надморска височина се наблюдава след 10 – 15 декември – за северните склонове, а за южните – след 20 – 30 декември. Снежната покривка се задържа средно 200 – 220 дни в годината, като за ниската зона на планината тя е най-дебела през февруари. Тогава средната месечна дебелина достига 20 – 30 cm. Във високата зона – над 2000 m надморска височина – снежната покривка е най-дебела през март – 70 – 80 cm. В най-високите части максималната дебелина на снежната покривка достига 200 – 240 cm. Средната продължителност на периода с устойчива снежна покривка е 70 – 80 дни за надморска височина 1200 – 1300 m, а при надморска височина над 2000 m достига до 180 – 200 дни. Не са изключение ветрове със скорост 30 – 40 m/s (над 100 km/h), с предимно югозападна и западна ориентация. Северозападните и североизточните ветрове са по-умерени. Средната месечна скорост на вятъра по най-високите планински върхове достига 11 – 12 m/s. В по-ниските части средната месечна скорост се изменя от 1,2 до 2,5 m/s, а в средната височинна зона от 2,5 – 3,2 m/s. ",
				Waters = "Рила е важен хидроложки възел за България с изключително голям хидроенергиен потенциал, представляващ около 1/4 от целия потенциал на страната. Планината попада в хидроложката област с континентално климатично влияние, планинска подобласт. По северните ѝ склонове и връх Мусала минава главният вододел, разделящ двата отточни басейна – Черноморския и Беломорския (Егейски).Водните запаси, които се формират в границите на планината са най-важният ресурс на чиста питейна вода за околните селища, София, част от населението на Северна Гърция и европейската част на Турция. Районът на населените места, разположени по западните склонове на Рила планина разполага с голям излишък от вода, тъй като оттокът надвишава потреблението около 8 пъти. Режимът на рилските реки е в пряка връзка с надморската височина и около половината от водните запаси в планината се намират на височина над 2050 m. От планината извират едни от най-пълноводните и дълги реки на Балканите – Искър, Марица и Места. Изворите на много притоци на тези реки, както и на притоци на Струма, също се намират във високопланинските части на Рила – Бели, Леви, Прав и Черни Искър, Бяла и Черна Места, реките Белишка, Благоевградска Бистрица, Градевска, Рилска. На територията на планината се формират около 10% от водните ресурси на Струма и Места, над 5% от тези на р. Марица и повече от 8% на р. Искър. Поради екзарационната дейност на ледниците през кватернера във високопланинските части на Рила са се образували голям брой ледникови езера. От тях по-голямата част са постоянни, около 35 са временни и за всички са характерни малките площ и обем. Обикновено заемат дъната на циркусите, циркусните тераси и троговите долини и са разположени на надморска височина между 2000 и 2600 m. Най-често имат закръглена или елипсовидна форма с малки дължина и ширина, като повечето са с площ под 10 дка. Тези води имат значение не толкова с количеството си, отколкото със своето качество и красотата на езерата, която привлича ежегодно хиляди туристи. Веригата на Седемте рилски езера е най-дългата, най-живописна и най-посещавана езерна група. В Рила са описани около 233 езера, от които 189 циркусни, а останалите имат тектонски или свлачищен произход.",
				Flora = "В Рила растат:\r\n\r\nдървета – обикновен габър (Carpinus betulus), зимен дъб (Quercus petraea), обикновен бук (Fagus sylvatica), трепетлика (Populus tremula), бреза (Betula pendula), обикновена ела (Abies alba), бяла мура (Pinus peuce), обикновен смърч (Picea abies), бял бор (Pinus sylvestris) покриват планинските склонове между 1600 до 2000 m.\r\nцветя – алпийска камбанка (Campanula alpina), планинско омайниче (Dryas octopetala), пролетна съсънка (Pulsatilla vernalis), иглика.",
				Fauna = "Общо 24 вида от срещащите се в Рила животни са вписани в Световната Червена книга. Гръбначните животни са 172 вида като 121 от тях са вписани в Българската Червена книга, 15 вида – в европейската Червена книга, 24 вида – в червения списък на Международния съюз за защита на природата (IUCN), а 158 – в списъците към Бернската конвенция.\r\n\r\nБезгръбначни\r\nВ Рила се срещат 2934 вида безгръбначни животни, като 242 са ендемични видове и подвидове. Общо 13 вида от безгръбначните животни живеещи тук са застрашени от изчезване в световен мащаб, а 41 вида са включени в световни и европейски списъци на застрашени видове.[38]\r\n\r\nРиби\r\nВ Рила се срещат 5 вида риби. Различни източници сочат, че видовото разнообразие на рибите достига до 18 като 4 от тях са балкански ендемити.[39] Дъговата и балканската пъстърва обитава езерата и язовирите и по-рядко реките Марица, Ибър, Крива река, Джерман. В рилските езера е широко разпространена лешанката. Видът е интродуциран за стръв от рибари. Някои от езерата са зарибени със сивен. Главочът се среща по-рядко, основно в река Черни Искър.\r\n\r\nЕндемитните видове в Рила са български – главоч (Cottus gobio haemusi) и струмски гулеш (Nemacheilus angorae bureschi) и балкански – маришка мряна (Barbus cyclolepis) и балкански щипок (Sabanejewia aurata balcanica).\r\n\r\nЗемноводни и влечуги\r\nПланината е обитавана от 20 вида земноводни и влечуги. Сред видовете, които се срещат в най-високите части на планината са планинска водна жаба, алпийски тритон, слепок, живороден гущер, ливаден гущер, усойница и медянка. От тях ендемичен вид е македонският гущер.\r\n\r\nПтици\r\nПтиците са представени от 99 вида (около 25% от орнитофауната на България) като тук са най-многобройните популации на глухара, лещарката и планинския кеклик, на пернатоногата и малката кукумявка. Тук се намират и едни от най-жизнените популации на хищни птици. От вписаните в Червената книга птици тук се срещат осояд, скален орел, горски бекас, белогръб кълвач, черен кълвач, малък креслив орел, сокол орко, голям ястреб, орел змияр, ловен сокол и други. Девет вида птици са престанали да гнездят тук.[40]\r\n\r\nБозайници\r\n\r\nЛешников сънливец\r\nБозайниците в Рила са 48 вида като тук е характерна популацията на дивата коза и високопланинската популация на лалугера.[38] Прилепите в Рила са десет, а дребните бозайници се подразделат на насекомоядни, зайци и гризачи. От тях са интересни таралежът, лешниковият сънливец и сляпото куче. Лалугерът е световно застрашен вид. Стабилна, но изолирана високопланинска колония от лалугери е установена в района на връх Белмекен. От по-едрите представители на бозайниците подвидовете на невестулката (Mustela nivalis galinthias) и дивата коза (Rupicapra rupicapra balcanica) са балкански ендемити.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Maliovitsa_District_Rila.jpg/1280px-Maliovitsa_District_Rila.jpg"
				},
				new Mountain
				{
					 Id = 3,
				Name = "Пирин",
				Location = "Пирин е разположен в югозападната част на страната между долините на реките Струма и Места, между 41\u00b026' и 41\u00b056' северна ширина. На север граница с Рила е седловината Предел (1142 м), а на юг – Парилската седловина (1170 м), която отделя Пирин от планината Славянка. На североизток планината достига до долината на река Места с Разложката и Гоцеделчевската котловина и пролома Момина клисура, я отделят от Родопите. На запад и югозапад долината на река Струма със своите котловини Симитлийска и Петричко-Санданска и Кресненският пролом я отделят от планините Влахина, Малешевска и Огражден.\r\n\r\nПлощта на планината е 2585 квадратни километра, т.е. тя е сравнително компактна, малка планина, което се потвърждава и от голямата ѝ средна височина – 1033 метра. Дължината ѝ по права линия от северозапад на югоизток е 66 км, а максималната ѝ широчина в направление югозапад-североизток е 40 километра – от град Сандански до село Обидим.",
				Climate = "Климатът в Пирин се отличава с голямо разнообразие, следствие от големите разлики в надморската височина, експозицията на склоновете, разчленението и подстилащата повърхнина. В по-ниските части и в долините на Струма и Места има силно средиземноморско влияние.\r\n\r\nНа север в района на Разложката котловина, разположена на ок. 940 м.н.в. е характерен умереноконтиненталния климат, дължащ се главно на голямата надморска височина на котловината. Средните януарски температури са ок. -2 \u00b0C, а валежите ок. 650 – 700 мм., като максимумът им е през ноември и вторичен – през юни. На юг в района на Гоцеделчевската котловина климатът е с преходносредиземноморски черти. Тук средногодишната температура достига 11,4 \u00b0C, а януарската е ок. 0 \u00b0C, валежите са предимно от дъжд със зимен максимум. Във високите части на планината климатът е типично планински. Средноянуарските температури варират от -1 до -2 \u00b0C в подножието и до -5 \u00b0C в по-високите части. Средната годишна температура на хижа „Вихрен“ е +3,5 \u00b0C. Количеството на валежите варира от 600 – 800 мм в по-ниските части до 1400 – 1500 мм в по-високите. Снежната покривка се задържа в по-високите части 7 – 8 месеца, а в Южен Пирин около 3 месеца. Често във високите части на планината през зимата се образуват опасни лавини.",
				Waters = "Пирин е много водна планина. Тя дава началото на голям брой реки, които принадлежат към водосборните басейни на Струма и Места. Те са сравнително къси, буйни и пълноводни, с голям наклон, поради което по тях се образуват множество водопади, прагове и бързеи. Има няколко по-изявени водопада – Влахинският водопад, Скоко, Попинолъшкият (15 м), Демянишки скок (11 м) и Юленски скок (9 м). Вододелът между водосборните басейни на Струма и Места минава по централното пиринско било. Пиринските реки имат снежно-дъждовен режим със силно изразен пролетен максимум. Най-голямото водно богатство на Пирин са красивите езера. На брой 186, те имат ледников произход, разположени са в малки и големи циркуси. Поради този си произход те са сравнително дълбоки, бистри, а поради височината – много студени. ",
				Flora = "Пирин е извънредно богат на растения и животни. Установени са около 1300 вида висши растения, което е 1/3 от всичките познати в България, 320 вида мъхове и няколкостотин вида водорасли. Висок е процентът на локалните ендемити – растения, които се срещат само в Пирин. Те са 18 на брой – пирински мак, пиринска ливадина, пиринска мащерка, давидов лопен и др. Много от растенията са редки и защитени, като например познатият на всички еделвайс, който се среща най-вече по Джамджиевите скали под Вихрен. Растителността е вертикално зонирана в три височинни пояса – горски, субалпийски и алпийски. Горският пояс е зает предимно от иглолистни дървета – бял и черен бор, бяла и черна мура, ела, обикновен смърч и достига приблизително до 2000 м. Оттам нагоре до 2500 м следва субалпийският пояс, в който доминират храстите клек и хвойна, чиито размери намаляват с увеличаването на височината. Накрая идва ред на алпийският пояс, зает от треви, лишеи и мъхове, а на границата между двата в изобилие се среща черната боровинка. По-особена е растителността край водните басейни, където най-често могат да се срещнат представителина рода на острицата. Най-известното дърво в Пирин е Байкушевата мура, носеща името на откривателя си, лесовъда Коста Байкушев. През 1897 година той изследва дървото с тръбна сонда и изчислява възрастта му на 1200 години. Приблизителните ѝ размери са височина 24 м, диаметър 2,2 м и обиколка 7,8 м.",
				Fauna = "Още по-голямо е богатството на животински видове. Познати са над 2000 вида и подвида безгръбначни животни (паяци, стоножки, насекоми, охлюви) и почти 250 вида гръбначни. От последните преобладават птиците (177 вида) и бозайниците (45 вида), а рибите са само 6 вида. Много от тези животни са застрашени и се нуждаят от специална защита – скален орел, трипръст кълвач, планински кефал, шипоопашата костенурка. Най-често могат да се срещнат дива коза, сърна, мечка, вълк, лисица, орел, сокол, глухар и др.",
				ImageUrls = "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Pogled_kum_prez_gr_Petrich_kum_gr_Sandanski.jpg/1280px-Pogled_kum_prez_gr_Petrich_kum_gr_Sandanski.jpg",
				},
			};

			_peaks = new List<Peak>
			{
				new Peak
				{
					Id=1,
					Name = "Ботев",
					Altitude = 2376,
					Partition = "Средна Стара планина",
					SpecificLocation = "Калоферска планина, И от заслон Ботев",
					Description = "Връх Ботев е най-високият връх в Стара планина и с неговите 2375,9 м тя нарежда планината на 3-то място по височина в България, след Рила (връх Мусала – 2925 м) и Пирин (връх Вихрен – 2914 м). Намира се в Средна Стара планина, в Национален парк „Централен Балкан“. Разположението му в сърцето на страната и множеството туристически маршрути, които го опасват, го правят привлекателен за множество планинари. В подножието му се намира и най-високия водопад на Балканския полуостров – Райското пръскало. Той е основна атракция в местността със своите 124,5 м, което допълнително популяризира връх Ботев.",
					ImageUrl = "https://izbulgaria.com/wp-content/uploads/2021/07/gledka-kam-vrah-botev-1024x768.jpg",
					MountainId = 1
				},
				new Peak
				{
					Id = 2,
					Name = "Мусала",
					Altitude = 2925,
					Partition = "Източна Рила",
					Description = "Мусала е първенецът на Рила и най-високият планински връх в България и на целия Балкански полуостров. Надморската му височина е 2925,4 m, измерена от равнището на пристанище Варна. По-висок е с 8 m от следващия по височина връх на Балканите, Митикас в планината Олимп в Гърция, и с 11 m от първенеца на Пирин, връх Вихрен, който заема третото място в класацията. Мусала има относителна надморска височина от 2473 m, което го подрежда на 7-о място в Европа.",
					ImageUrl = "https://svetogled.com/wp-content/uploads/2021/08/DSC_0050_1.jpg",
					MountainId = 2
				},
				new Peak
				{
					Id = 3,
					Name = "Вихрен",
					Altitude = 2914,
					Partition = "Северен Пирин",
					Description = "Вѝхрен (до 29 юни 1942 г. Елтепе, Ел-тепе) е най-високият връх на Пирин. Със своите 2914 метра Вихрен е втори по височина в България след Мусала (2925,4) в Рила и трети на Балканския полуостров след Митикас (2917,727[3]) в Олимп. Гледан от Банско Вихрен прилича на пресечена пирамида, а от юг – на четиристенна пирамида. За този връх е характерно, че изглежда по много различен начин от различните посоки. Скалите, които изграждат Вихрен, са мрамори, които не задържат вода, поради което в целия район на върха няма реки и езера. Най-близките езера са Влахините на югозапад. Растителността по склоновете на Вихрен е бедна – трева и лишеи, докато животинският свят е по-богат – има птици, дребни гризачи, но най-вече диви кози, които обитават Казаните в подножието на върха. Цветето еделвайс се среща в изобилие по скалния ръб Джамджиеви скали.",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/07/MANE2800a.jpg",
					MountainId = 3
				},
			};

			_huts = new List<Hut>
			{
				new Hut
				{
					Id = 1,
					Name = "Безбог",
					Altitude = 2240,
					Camping = Camping.Permitted,
					WorkTime = WorkTime.All,
					Phone = "0888286102",
					HasBathroom = true,
					HasCanteen = true,
					HasToilet = true,
					Description = "Разположена е край северната част на Безбожкото езеро в Северен Пирин. Предаставлява масивна пететажна сграда с капацитет 130 места с етажни санитарни възли и бани. Хижата е електрифицирана, водоснабдена, с централно отопление. Има ресторант, кафе-аперитив, лафка.",
					Places = 130,
					ImageUrl = "https://www.tourism-bg.net/hiji/img/bezbog.jpg",
					MountainId = 3
				},
			};

			_lakes = new List<Lake>
			{
				new Lake
				{
					Id = 1,
					Name = "Горно Полежанско",
					Description = "Смята се, че е Горното Полежанско езеро (2710 м), въпреки че има различни измервания и спор дали е то или Леденото езеро в Рила планина.Горно Полежанското езеро се намира в Северен Пирин на 2710 м н.в. под връх Полежан. То е част от езерната група на Полежанските езера, които са три на брой. Често през сухите лета няма да го видите, защото то пресъхва.",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/08/MANE3567-1-1024x683.jpg",
					MountainId = 2
				},
				new Lake
				{
					Id = 2,
					Name = "Страшното езеро",
					Description = "Езерото е дълго 200 m, широко 75 m и дълбоко до 2 m, а площта му е 14,4 дка. То е най-голямото и най-високо разположеното от езерата в Прекоречкия циркус на Мальовишкия дял. Оттича се на север, към долината на Горна (Трета) Прека река.Вдълбано е в подножието на връх Попова капа и Купените. Техните надвиснали скали създават забележителна акустика, която при буря отразява многогласно гръмотевиците.",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSCF4676-1024x683.webp",
					MountainId = 1
				},
			};

			_waterfalls = new List<Waterfall>
			{
				new Waterfall
				{
					Id = 1,
					Name = "Райското пръскало",
					Description = "Райското пръскало е най-високият постоянен водопад в България и на Балканския полуостров – 124,5 m.Намира се в Стара планина, на южния склон под най-високия старопланински връх – Ботев. На територията е на природен резерват „Джендема“, част от Национален парк „Централен Балкан“.",
					ImageUrl = "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/%D0%A0%D0%B0%D0%B9%D1%81%D0%BA%D0%BE%D1%82%D0%BE_%D0%BF%D1%80%D1%8A%D1%81%D0%BA%D0%B0%D0%BB%D0%BE_%D0%91%D0%B0%D0%BB%D0%BA%D0%B0%D0%BD.jpg/1200px-%D0%A0%D0%B0%D0%B9%D1%81%D0%BA%D0%BE%D1%82%D0%BE_%D0%BF%D1%80%D1%8A%D1%81%D0%BA%D0%B0%D0%BB%D0%BE_%D0%91%D0%B0%D0%BB%D0%BA%D0%B0%D0%BD.jpg",
					MountainId = 1
				}
			};

			_routes = new List<Route>
			{
				new Route
				{
					Id = 1,
					Name = "Връх Безбог",
					Description = "Връхът може да се изкачи по два маршрута. Най-популярният е като тръгнете към “душеватката” и Попово езеро, след което се изкачите на седловината между върховете Полежан и Безбог (вторият етап на прехода, който сме описали тук, но в обратна посока). Маршрутът тръгва покрай десния бряг Безбожкото езеро, където вдясно ще видите изоставена постройка. Това са руините на старата хижа „Безбог“, която е разрушена от лавина през 1971 година. Пътеката към върха минава вляво на постройката. По тази пътека няма маркировка, но „пирамидките“ от камъни могат да ви водят.Поглед към връх Безбог в Пирин.Пътеката е доста стръмна и през по- голямата част е през клекове. Малко преди върха започва каменист участък, който също е стръмен. Внимавайте къде стъпвате между камъните.На самия връх има кръст и веднага ще го познаете щом го видите.Гледката оттук е много красива: на Изток част от Кременското езеро, до него върховете Севрия, Джано, Джангал както и част от Поповото езеро. В другата посока се виждат връх Полежан, Стражите и Десилица.",
					StartingPoint = "Хижа Безбог",
					Difficulty = Difficulty.Moderate,
					DisplacementPositive = 450,
					DisplacementNegative = 450,
					Duration = "0.02:40",
					ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSCF5440-1024x819.webp",
					MountainId = 3
				},
				new Route
				{
					  Id = 2,
				Name = "Връх Мусала – най-високият връх в България и на Балканите",
				StartingPoint = "Хижа Ястребец",
				Description = "Хижа „Ястребец“ – хижа „Мусала“\r\nОт лифта тръгнете по главната пътека към хижата. Пътеката е почти равна и широка. Най-вероятно ще видите много хора и трудно бихте се объркали. Маршрута до хижата отнема около час, а маркировката, която трябва да следвате е червена. Повече информация може да прочетете в статията ни за хижа „Мусала.\r\n\r\nВръх Иречек вляво и връх Мусала вдясно, отпред Мусаленското езеро\r\nХижа „Мусала“ – Ледено езеро\r\nСлед като стигнете хижа „Мусала“ ви остават около 2 часа преход до върха. До хижата се намират първите три езера от езерната група Мусаленски езера. Тръгнете по дясната страна на езерото пред хижа „Мусала“. От тук започва постепенно изкачване, пътеката става все по-камениста и все по-често се върви по морени. По пътеката ще минете покрай две езера, първото от които е Алековото езеро. След около 30-35 минути ще достигнете до Леденото езеро.\r\n\r\n\r\nЛедено езеро – връх Мусала\r\nСега е моментът да си отдъхнете преди последното изкачване. То е най-трудно и изморително заради голямата денивелация. Тук е и единствената чешма по пътя.\r\n\r\n\r\n\r\nИма две пътеки – лятна и зимна. Зимната е камениста и стръмна, но има обезопасително метално въже.\r\n\r\n\r\nЗа по-неопитните туристи е препоръчително да изберат лятната пътека. След около половин час нагоре ще стигнете най-високата точка на България.\r\n\r\nГледка от връх Мусала към Леденото езеро\r\n\r\nПред вас ще се открие уникална гледка към върхове и езера. На юг са Маричините езера, на север – Ледено езеро и местността, от която дойдохте, на изток – върховете Малка Мусала (2902 м) и Иречек (2852 м). При ясно време можете да видите в далечината на запад връх Мальовица.",
				Difficulty = Difficulty.Moderate,
				DisplacementNegative = 104,
				DisplacementPositive = 684,
				Duration = "0.05:00",
				ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSC6986-1024x680.webp",
				MountainId = 2
				},
			};

			_routePeaks = new List<RoutePeak>
			{
				new RoutePeak
				{
					RouteId = 2,
					PeakId = 2
				},
			};

			_routeHuts = new List<RouteHut>
			{
				new RouteHut
				{
					RouteId = 1,
					HutId = 1
				},
			};

			_context.AddRange(_mountains);
			_context.AddRange(_peaks);
			_context.AddRange(_huts);
			_context.AddRange(_lakes);
			_context.AddRange(_waterfalls);
			_context.AddRange(_routes);
			_context.AddRange(_routePeaks);
			_context.AddRange(_routeHuts);

			_context.SaveChanges();
		}

		[TearDown]
		public async Task TearDown()
		{
			await _context.Database.EnsureDeletedAsync();
			await _context.SaveChangesAsync();
		}

		[Test]
		public async Task AddAsync_ShouldAddRoute()
		{
			var routeForm = new RouteAddViewModel
			{
				Name = "град Калофер – водопад Райското пръскало",
				Description = "От Калофер до местността Долен Параджик\r\nТръгваме към Райското пръскало от местността Паниците в Калофер. Маршрутът започва по стръмна горска пътека, която продължава около половин час. След като излезем от горския пояс, наклонът рязко намалява. Намираме се на обширни поляни, по които се движим в следващия час и петнайсетина минути. Тук е много горещо в летните дни. Препоръчвам ранно тръгване, за да избегнете обедния ад. Първата чешма се намира двайсетина минути след края на гората, леко вляво.\r\nСлед повече от час вървене на открито, излизаме на разклон в местността Долен Параджик. Наляво е екопътека „Бяла река“, надясно е жълтият маршрут за връх Ботев, а направо е нашата пътека към хижа Рай и Райското пръскало. 5 минути след разклона се открива една от най-красивите гледки по българските планини – към Джендема и връх Ботев над него. Зашеметяваща е! Има няколко пейки, на които да починете с тази гледка насреща. Общо от Калофер до тук е около 1:45 ч.\r\nОт местността Долен Параджик до хижа Рай\r\nНавлизаме в резерват Джендема, по чийто скалисти склонове тече Райското пръскало. Поглед напред разкрива какво ни очаква – слизане до долината под нас и изкачване до гребена на Райските купени отсреща. Хижа Рай се намира на върха му, от другата страна на гората.\r\nЗапочваме леко спускане по широк черен път, който навлиза в букова гора. След 15-20 минути пътят свършва на едно уширение. Вляво от него тръгва тясна горска пътека. Гората се сгъстява, а наклонът се увеличава, но не много. Скоро достигаме река Малка Бъзовица, след която наклонът се обръща нагоре. Малко след нея стигаме до чешмата Мечата глава. Бях по този маршрут през септември и почти не течеше вода по чучура. За щастие след десетина минути има друга чешма, която течеше нормално.\r\nМного скоро наклонът рязко се увеличава – веднага след като прекосим едно поточе. Оттук нататък вървенето става доста тежко в продължение на час и половина, може и повече – почти до хижа Рай. За щастие гората е гъста и предпазва от жаркото слънце. След като излезем от горския пояс, остават пет минутки до хижата. Ето че красивата ни цел се вижда ясно зад нея – Райското пръскало се спуска по Джендема.\r\nОт хижа Рай до Райското пръскало\r\nАко мислим, че се е свършило – не е така. Имаме още половин час до Райското пръскало по също толкова стръмна пътека, колкото досега. Продължаваме от другата страна на хижа Рай, минаваме покрай параклиса и се запътваме в посока водопада. Точно където се прекосява река Пръскалска, на първия завой на пътеката край едни камъни има разклонение. Основният маршрут продължава към Тарзановата пътека и връх Ботев, а вдясно излиза малка пътека, по която ние трябва да тръгнем. Тук ще вметна, че ако идвате май и юни, е много вероятно реката да е пълноводна. Затова е препоръчително да бъдете с хубави непромокаеми обувки.\r\nОттук до Райското пръскало няма много за описване. Само ще обърна внимание, че на места пътеката е сипеста и хлъзгава, но нищо сериозно. След двайсетина минути сме в подножието на водопада.\r\nВъзможност за продължение на маршрута е да слезем и да поемем по маршрута от хижа Рай до връх Ботев или към хижа Васил Левски.",
				Difficulty = Difficulty.Moderate,
				DisplacementPositive = 894,
				Duration = "0.05:00",
				ImageUrl = "https://izbulgaria.com/wp-content/uploads/2021/07/raiskoto-praskalo-768x576.jpg",
				MountainId = 1
			};

			var selectedPeaksIds = new List<int> { };
			var selectedHutsIds = new List<int> { };
			var selectedLakesIds = new List<int> { }; 
			var selectedWaterfallsIds = new List<int> { 1 };

			await _routeService.AddAsync(routeForm, selectedPeaksIds, selectedHutsIds, selectedLakesIds, selectedWaterfallsIds);

			var result = await _routeService.GetAllRoutesAsync();

			Assert.That(result.Count(), Is.EqualTo(3));
		}

		[Test]
		public async Task AddAsync_ShouldAddAllSelectedObjects()
		{
			var routeForm = new RouteAddViewModel
			{
				Name = "град Калофер – водопад Райското пръскало",
				Description = "От Калофер до местността Долен Параджик\r\nТръгваме към Райското пръскало от местността Паниците в Калофер. Маршрутът започва по стръмна горска пътека, която продължава около половин час. След като излезем от горския пояс, наклонът рязко намалява. Намираме се на обширни поляни, по които се движим в следващия час и петнайсетина минути. Тук е много горещо в летните дни. Препоръчвам ранно тръгване, за да избегнете обедния ад. Първата чешма се намира двайсетина минути след края на гората, леко вляво.\r\nСлед повече от час вървене на открито, излизаме на разклон в местността Долен Параджик. Наляво е екопътека „Бяла река“, надясно е жълтият маршрут за връх Ботев, а направо е нашата пътека към хижа Рай и Райското пръскало. 5 минути след разклона се открива една от най-красивите гледки по българските планини – към Джендема и връх Ботев над него. Зашеметяваща е! Има няколко пейки, на които да починете с тази гледка насреща. Общо от Калофер до тук е около 1:45 ч.\r\nОт местността Долен Параджик до хижа Рай\r\nНавлизаме в резерват Джендема, по чийто скалисти склонове тече Райското пръскало. Поглед напред разкрива какво ни очаква – слизане до долината под нас и изкачване до гребена на Райските купени отсреща. Хижа Рай се намира на върха му, от другата страна на гората.\r\nЗапочваме леко спускане по широк черен път, който навлиза в букова гора. След 15-20 минути пътят свършва на едно уширение. Вляво от него тръгва тясна горска пътека. Гората се сгъстява, а наклонът се увеличава, но не много. Скоро достигаме река Малка Бъзовица, след която наклонът се обръща нагоре. Малко след нея стигаме до чешмата Мечата глава. Бях по този маршрут през септември и почти не течеше вода по чучура. За щастие след десетина минути има друга чешма, която течеше нормално.\r\nМного скоро наклонът рязко се увеличава – веднага след като прекосим едно поточе. Оттук нататък вървенето става доста тежко в продължение на час и половина, може и повече – почти до хижа Рай. За щастие гората е гъста и предпазва от жаркото слънце. След като излезем от горския пояс, остават пет минутки до хижата. Ето че красивата ни цел се вижда ясно зад нея – Райското пръскало се спуска по Джендема.\r\nОт хижа Рай до Райското пръскало\r\nАко мислим, че се е свършило – не е така. Имаме още половин час до Райското пръскало по също толкова стръмна пътека, колкото досега. Продължаваме от другата страна на хижа Рай, минаваме покрай параклиса и се запътваме в посока водопада. Точно където се прекосява река Пръскалска, на първия завой на пътеката край едни камъни има разклонение. Основният маршрут продължава към Тарзановата пътека и връх Ботев, а вдясно излиза малка пътека, по която ние трябва да тръгнем. Тук ще вметна, че ако идвате май и юни, е много вероятно реката да е пълноводна. Затова е препоръчително да бъдете с хубави непромокаеми обувки.\r\nОттук до Райското пръскало няма много за описване. Само ще обърна внимание, че на места пътеката е сипеста и хлъзгава, но нищо сериозно. След двайсетина минути сме в подножието на водопада.\r\nВъзможност за продължение на маршрута е да слезем и да поемем по маршрута от хижа Рай до връх Ботев или към хижа Васил Левски.",
				Difficulty = Difficulty.Moderate,
				DisplacementPositive = 894,
				Duration = "0.05:00",
				ImageUrl = "https://izbulgaria.com/wp-content/uploads/2021/07/raiskoto-praskalo-768x576.jpg",
				MountainId = 1
			};

			var selectedPeaksIds = new List<int> { 1 };
			var selectedHutsIds = new List<int> { 1 };
			var selectedLakesIds = new List<int> { 1 };
			var selectedWaterfallsIds = new List<int> { 1 };

			await _routeService.AddAsync(routeForm, selectedPeaksIds, selectedHutsIds, selectedLakesIds,
				selectedWaterfallsIds);

			var routePeaks = _context.RoutesPeaks.ToList();
			var routeHuts = _context.RoutesHuts.ToList();
			var routeLakes = _context.RoutesLakes.ToList();
			var routeWaterfalls = _context.RoutesWaterfalls.ToList();

			Assert.That(routePeaks.Count, Is.EqualTo(2));
			Assert.That(routeHuts.Count, Is.EqualTo(2));
			Assert.That(routeLakes.Count, Is.EqualTo(1));
			Assert.That(routeWaterfalls.Count, Is.EqualTo(1));
		}


		[Test]
		public async Task EditGetAsync_ShouldGetInformationAboutRouteForEdit()
		{
			var route = await _routeService.DetailsAsync(1);

			route.Difficulty = Difficulty.Moderate.ToString();

			var result = await _routeService.EditGetAsync(1);

			Assert.That(result, Is.Not.Null);
			Assert.That(result.Id, Is.EqualTo(route.Id));
			Assert.That(result.Name, Is.EqualTo(route.Name));
			Assert.That(result.Description,
				Is.EqualTo(route.Description));
			Assert.That(result.StartingPoint, Is.EqualTo(route.StartingPoint));
			Assert.That(result.Difficulty.ToString(), Is.EqualTo(route.Difficulty.ToString()));
			Assert.That(result.DisplacementPositive, Is.EqualTo(route.DisplacementPositive));
			Assert.That(result.DisplacementNegative, Is.EqualTo(route.DisplacementNegative));
			Assert.That(result.Duration, Is.EqualTo(route.Duration));
			Assert.That(result.ImageUrl, Is.EqualTo(route.ImageUrl));
		}

		[Test]
		public async Task EditPostAsync_ShouldEditRoute()
		{
			var routeForm = new RouteEditViewModel
			{
				Id = 2,
				Name = "Връх Мусала – най-високият връх в България и на Балканите",
				StartingPoint = "Хижа Ястребец",
				Description =
					"Хижа „Ястребец“ – хижа „Мусала“\r\nОт лифта тръгнете по главната пътека към хижата. Пътеката е почти равна и широка. Най-вероятно ще видите много хора и трудно бихте се объркали. Маршрута до хижата отнема около час, а маркировката, която трябва да следвате е червена. Повече информация може да прочетете в статията ни за хижа „Мусала.\r\n\r\nВръх Иречек вляво и връх Мусала вдясно, отпред Мусаленското езеро\r\nХижа „Мусала“ – Ледено езеро\r\nСлед като стигнете хижа „Мусала“ ви остават около 2 часа преход до върха. До хижата се намират първите три езера от езерната група Мусаленски езера. Тръгнете по дясната страна на езерото пред хижа „Мусала“. От тук започва постепенно изкачване, пътеката става все по-камениста и все по-често се върви по морени. По пътеката ще минете покрай две езера, първото от които е Алековото езеро. След около 30-35 минути ще достигнете до Леденото езеро.\r\n\r\n\r\nЛедено езеро – връх Мусала\r\nСега е моментът да си отдъхнете преди последното изкачване. То е най-трудно и изморително заради голямата денивелация. Тук е и единствената чешма по пътя.\r\n\r\n\r\n\r\nИма две пътеки – лятна и зимна. Зимната е камениста и стръмна, но има обезопасително метално въже.\r\n\r\n\r\nЗа по-неопитните туристи е препоръчително да изберат лятната пътека. След около половин час нагоре ще стигнете най-високата точка на България.\r\n\r\nГледка от връх Мусала към Леденото езеро\r\n\r\nПред вас ще се открие уникална гледка към върхове и езера. На юг са Маричините езера, на север – Ледено езеро и местността, от която дойдохте, на изток – върховете Малка Мусала (2902 м) и Иречек (2852 м). При ясно време можете да видите в далечината на запад връх Мальовица.",
				Difficulty = Difficulty.Moderate,
				DisplacementNegative = 204,
				DisplacementPositive = 784,
				Duration = "0.05:30",
				ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSC6986-1024x680.webp",
			};

			var selectedPeaksIds = new List<int> { 1 };
			var selectedHutsIds = new List<int> { 1 };
			var selectedLakesIds = new List<int> { 1 };
			var selectedWaterfallsIds = new List<int> { 1 };

			await _routeService.EditPostAsync(routeForm, selectedPeaksIds, selectedHutsIds, selectedLakesIds, selectedWaterfallsIds);

			var result = await _routeService.DetailsAsync(2);

			result.Difficulty = Difficulty.Moderate.ToString();

			Assert.That(result, Is.Not.Null);
			Assert.That(result.Id, Is.EqualTo(routeForm.Id));
			Assert.That(result.Name, Is.EqualTo(routeForm.Name));
			Assert.That(result.Description, Is.EqualTo(routeForm.Description));
			Assert.That(result.StartingPoint, Is.EqualTo(routeForm.StartingPoint));
			Assert.That(result.Difficulty, Is.EqualTo(routeForm.Difficulty.ToString()));
			Assert.That(result.DisplacementPositive, Is.EqualTo(routeForm.DisplacementPositive));
			Assert.That(result.DisplacementNegative, Is.EqualTo(routeForm.DisplacementNegative));
			Assert.That(result.Duration, Is.EqualTo(routeForm.Duration));
			Assert.That(result.ImageUrl, Is.EqualTo(routeForm.ImageUrl));


			foreach (var peakId in routeForm.SelectedPeaksIds)
			{
				// Ensure that each selected peak is associated with the edited route
				var existingRoutePeak = await _context.RoutesPeaks.FirstOrDefaultAsync(rp => rp.RouteId == result.Id && rp.PeakId == peakId);
				Assert.IsNotNull(existingRoutePeak);
				// Add additional assertions if needed
			}

			// Check huts
			foreach (var hutId in routeForm.SelectedHutsIds)
			{
				// Ensure that each selected hut is associated with the edited route
				var existingRouteHut = await _context.RoutesHuts.FirstOrDefaultAsync(rh => rh.RouteId == result.Id && rh.HutId == hutId);
				Assert.IsNotNull(existingRouteHut);
				// Add additional assertions if needed
			}

			// Check lakes
			foreach (var lakeId in routeForm.SelectedLakesIds)
			{
				// Ensure that each selected lake is associated with the edited route
				var existingRouteLake = await _context.RoutesLakes.FirstOrDefaultAsync(rl => rl.RouteId == result.Id && rl.LakeId == lakeId);
				Assert.IsNotNull(existingRouteLake);
				// Add additional assertions if needed
			}

			// Check waterfalls
			foreach (var waterfallId in routeForm.SelectedWaterfallsIds)
			{
				// Ensure that each selected waterfall is associated with the edited route
				var existingRouteWaterfall = await _context.RoutesWaterfalls.FirstOrDefaultAsync(rw => rw.RouteId == result.Id && rw.WaterfallId == waterfallId);
				Assert.IsNotNull(existingRouteWaterfall);
				// Add additional assertions if needed
			}
		}

		[Test]
		public async Task GetAllRoutesAsync_ShouldReturnAllRoutes()
		{
			var result = await _routeService.GetAllRoutesAsync();

			Assert.That(result, Is.Not.Null);
			Assert.That(result.Count(), Is.EqualTo(2));
		}

		[Test]
		public async Task AllRoutesPaginationAsync_ShouldReturnAllRoutesWithPagination()
		{
			var result = await _routeService.AllRoutesPaginationAsync(1, 1);

			Assert.That(result.Routes, Is.Not.Null);
			Assert.That(result.Routes.Count(), Is.EqualTo(1));
			Assert.That(result.TotalPages, Is.EqualTo(2));
		}

		[Test]
		public async Task CheckIfExistRouteById_ShouldReturnTrue()
		{
			var routeId = 1;

			var result = await _routeService.CheckIfExistRouteById(routeId);

			Assert.That(result, Is.True);
		}

		[Test]
		public async Task CheckIfExistRouteById_ShouldReturnFalse()
		{
			var routeId = 3;

			var result = await _routeService.CheckIfExistRouteById(routeId);

			Assert.That(result, Is.False);
		}

		[Test]
		public async Task CheckIfExistRouteByName_ShouldReturnTrue()
		{
			var routeName = "Връх Безбог";

			var result = await _routeService.CheckIfExistRouteByName(routeName);

			Assert.That(result, Is.True);
		}

		[Test]
		public async Task CheckIfExistRouteByName_ShouldReturnFalse()
		{
			var routeName = "Връх Мусала";

			var result = await _routeService.CheckIfExistRouteByName(routeName);

			Assert.That(result, Is.False);
		}

		[Test]
		public async Task DetailsAsync_ShouldReturnRouteDetails()
		{
			var result = await _routeService.DetailsAsync(1);

			result.Difficulty = Difficulty.Moderate.ToString();

			Assert.That(result, Is.Not.Null);
			Assert.That(result.Id, Is.EqualTo(1));
			Assert.That(result.Name, Is.EqualTo("Връх Безбог"));
			Assert.That(result.Description,
				Is.EqualTo(
					"Връхът може да се изкачи по два маршрута. Най-популярният е като тръгнете към “душеватката” и Попово езеро, след което се изкачите на седловината между върховете Полежан и Безбог (вторият етап на прехода, който сме описали тук, но в обратна посока). Маршрутът тръгва покрай десния бряг Безбожкото езеро, където вдясно ще видите изоставена постройка. Това са руините на старата хижа „Безбог“, която е разрушена от лавина през 1971 година. Пътеката към върха минава вляво на постройката. По тази пътека няма маркировка, но „пирамидките“ от камъни могат да ви водят.Поглед към връх Безбог в Пирин.Пътеката е доста стръмна и през по- голямата част е през клекове. Малко преди върха започва каменист участък, който също е стръмен. Внимавайте къде стъпвате между камъните.На самия връх има кръст и веднага ще го познаете щом го видите.Гледката оттук е много красива: на Изток част от Кременското езеро, до него върховете Севрия, Джано, Джангал както и част от Поповото езеро. В другата посока се виждат връх Полежан, Стражите и Десилица."));
			Assert.That(result.StartingPoint, Is.EqualTo("Хижа Безбог"));
			Assert.That(result.Difficulty, Is.EqualTo(Difficulty.Moderate.ToString()));
			Assert.That(result.DisplacementPositive, Is.EqualTo(450));
			Assert.That(result.DisplacementNegative, Is.EqualTo(450));
			Assert.That(result.Duration, Is.EqualTo("0.02:40"));
			Assert.That(result.ImageUrl,
								Is.EqualTo("https://planinka.bg/wp-content/uploads/2022/09/DSCF5440-1024x819.webp"));
			Assert.That(result.MountainId, Is.EqualTo(3));
		}

		[Test]
		public async Task DeleteAsync_ShouldReturnRouteDeleteViewModel()
		{
			var route = await _routeService.DetailsAsync(1);

			var result = await _routeService.DeleteAsync(1);

			Assert.That(result, Is.Not.Null);
			Assert.That(result.Name, Is.EqualTo(route.Name));
			Assert.That(result.Description, Is.EqualTo(route.Description));
			Assert.That(result.StartingPoint, Is.EqualTo(route.StartingPoint));
			Assert.That(result.ImageUrl, Is.EqualTo(route.ImageUrl));
			Assert.That(result.MountainName, Is.EqualTo(route.MountainName));
		}

		[Test]
		public async Task DeleteAsync_ShouldDeleteRoute()
		{
			await _routeService.DeleteConfirmedAsync(1);

			var result = await this._context.Routes.FirstOrDefaultAsync(h => h.Id == 1);

			Assert.IsNull(result);
		}

		[Test]
		public async Task DeleteAsync_ShouldDeleteRoutesObjectsRelationMap()
		{
			await _routeService.DeleteConfirmedAsync(1);
			await _routeService.DeleteConfirmedAsync(2);

			var routeHut = await this._context.RoutesHuts.FirstOrDefaultAsync(h => h.RouteId == 1);
			var routePeak = await this._context.RoutesPeaks.FirstOrDefaultAsync(h => h.RouteId == 2);

			Assert.IsNull(routeHut);
			Assert.IsNull(routePeak);
		}
	}
}
