using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using PeaksAndAdventures.Infrastructure.Data.Models;
using System.Reflection.Emit;

namespace PeaksAndAdventures.Infrastructure.Data.Configurations
{
    public class ExpeditionConfiguration : IEntityTypeConfiguration<Expedition>
    {
        public void Configure(EntityTypeBuilder<Expedition> builder)
        {

           builder
                .HasOne(e => e.Route)
                .WithMany(r => r.Expeditions)
                .HasForeignKey(e => e.RouteId)
                .OnDelete(DeleteBehavior.Restrict);

           builder.HasOne(e => e.TourAgency)
               .WithMany(e => e.Expeditions)
               .HasForeignKey(e => e.TourAgencyId)
               .OnDelete(DeleteBehavior.Restrict);

           builder
               .HasMany(e => e.ExpeditionsParticipants)
               .WithOne(ep => ep.Expedition)
               .HasForeignKey(ep => ep.ExpeditionId)
               .OnDelete(DeleteBehavior.Restrict);

            builder.HasData(GenerateExpeditions());
        }

        private Expedition[] GenerateExpeditions()
        {
            ICollection<Expedition> expeditions = new HashSet<Expedition>();

            expeditions.Add(new Expedition()
            {
                Id = 1,
                Name = "Изпитай себе си и изкачи Еверест!",
                Days = 71,
                StartDate = new DateTime(2024, 04, 01),
                EndDate = new DateTime(2024, 06, 10),
                Includes = "Такса за разрешение за Еверест (в момента $11,500.00 на човек)\r\nТакса за ледопад Кхумбу\r\nSPCC такса за боклук и разходи за управление на боклука в базовия лагер\r\nКолективна такса за фиксирана линия над базовия лагер\r\nФонд за базовия лагер на Himalayan Rescue Assn за спешни медицински случаи и покритие за шерпи.\r\nНадбавка за офицер за връзка\r\nКатерене на шерпи\r\nПерсонал на базовия лагер - готвач, помощник-готвач, носачи\r\nЗастрахователно покритие на персонала за спешна евакуация с хеликоптер и медицинска застраховка\r\nВсички хранения\r\nПалатки за спане в базовия лагер (1 на член) и общи палатки в по-високите лагери\r\nПалатка за тоалетна и душ\r\nСъоръжения за първа помощ и използване на HRA станцията в базовия лагер\r\nКислородни бутилки (3 литра х 6 на човек), плюс една маска и регулатор на човек\r\nФиксирано въже и снежни барове (обикновено се предоставят от общността, но ние също ще имаме наши собствени)\r\nСтолова палатка BC и C2\r\nПреходът струва до базовия лагер и транспорт на оборудването с якове и носачи\r\nНастаняване в Катманду - двойна стая за 3 нощувки\r\nЛукла полет",
                Excludes = "Западен гид - може да се добави на частна основа.\r\nМеждународно пътуване до Катманду\r\nВсички полети с хеликоптер, използвани по лични причини\r\nЛична туристическа застраховка\r\nЛична екипировка и екипировка за катерене\r\nНепалска виза\r\nДопълнителни кислородни бутилки (700 USD всяка)\r\nРазходи, свързани с преждевременно приключване на експедиция или преждевременно напускане на експедиция.\r\nРазходи, свързани с удължаване на пътуване поради лошо време или други обстоятелства, включително разходите за допълнителни нощувки\r\nБонус за деня на срещата на върха към вашия водач шерпа от 2000,00 USD",
                Extras = "ХОТЕЛ ЯК И ЙЕТИ\r\n3 нощувки в двойна/двойна стандартна стая в този луксозен 5-звезден хотел, предлагащ съчетание от съвременна изтънченост и културно наследство със своя 100-годишен дворец и новопроектираната структура на хотела за 495$",
                RouteId = 6,
                Enrolment = 20,
                TourAgencyId = 1,
                Price = 55_000.00m,
                Program = "Връх Еверест е общо 10-седмична експедиция, с 2 седмици време за преход и 8 седмици период на изкачване. Не очаквайте обаче да се приберете у дома след изкачването на Еверест и да се върнете към нормалния живот, може да отнеме седмици и дори месеци, за да се възстановите напълно, както физически, така и психически.\r\n\r\nРаботим по съгласуван принцип за достигане на определени височини и спане в определени лагери по структуриран начин за период от осем седмици след достигане на базовия лагер, което позволява както зареждане на лагерите, така и оптимално време за аклиматизация. Програмата за катерачите се определя до голяма степен от графика на лагерите за зареждане, който от своя страна се определя от времето и позволява достатъчно почивки. Всеки опитен катерач ще разбере тази политика и ще се чувства удобно с гъвкавостта.\r\n\r\nПОХОД И АКЛИМАТИЗАЦИОНЕН ПЕРИОД ПРИ ИЗКАЧВАНЕ НА ЕВЕРЕСТ\r\nПървите 10 дни преминават в преход до базовия лагер. След това следва период на почивка и установяване. Ръководителите на екипи ще се срещнат и ще обсъдят съвместни операции по въпроси като поставяне на стационарни линии. Екипите също трябва да изчакат ледопадът да бъде „поправен“ от екипите на шерпите, чиято работа е да поставят стълбите и фиксираните въжета. Това отново може да отнеме дни.\r\n\r\nСледващият месец ще бъде прекаран в извършване на редица проучвателни изкачвания до лагер 1 през ледопада Khumbu и след това до лагер 2, където е важно да прекарате няколко нощувки. Времето и адаптацията към надморската височина ще определят точните дни, в които екипът ще се изкачва и почива. Носенето на лична екипировка може да се направи, докато шерпите поставят цялото основно оборудване до високите лагери. През това време ние също се аклиматизираме, като изкачваме друг връх в района, като Lobuche East или Island Peak.\r\n\r\nИма поне едно посещение на лагер 3 за нощувка. Това ще бъде добър шанс да тествате реакцията на тялото на много голяма надморска височина. За повечето хора Лагер 3 е най-високата точка, която ще достигнат без използването на бутилиран кислород, въпреки че някои хора избират да купят допълнителни бутилки, за да помогнат да стигнат до тази точка. След посещение на лагер 3 обикновено има почивка в базовия лагер или по-ниско, като подготовка за наддаване на върха. Често слизаме в Дебош, за да видим малко трева и да хапнем добра храна. ПЕРИОД НА ВЪРХА НА ЕВЕРЕСТ\r\nСлед като бъде взето решение да се направи опит за изкачване на върха в период някъде около средата на две седмици на май (статистически това е сравнително нормално, но хората са се изкачвали преди и след), тогава общият цикъл на върха от основата до върха и обратно е нормално седем дни, което позволява няколко нощувки в лагер 2 и след това една нощ в лагер 3. Изкачването до лагер 4 на южния стълб на Еверест става част от самото изкачване на върха, тъй като обикновено екипите пристигат в средата на следобед и почиват до около 21:00 когато се използват бутилки с пресен кислород, за да се изкачите до Балкона и да се присъедините към югоизточното било.\r\n\r\nСутринта на върха може да бъде съпътствана от проблеми с пренаселеността, особено на скалистото стъпало под южния връх. Обикновено груповият ред се определя по взаимно съгласие между ръководствата на компанията, но това не винаги е приложимо. Не е необичайно да откриете, че се движите много бавно зад голяма група или бавен индивид без възможност за изпреварване. Това води до студ и прекомерна употреба на ресурси като кислород. На балкона обикновено има смяна на бутилки, което дава възможност за промяна на груповия ред.\r\n\r\nОт Балкона до южния връх няма много възможности за изпреварване, въпреки че някои групи ще създадат свои собствени фиксирани линии от едната страна на основната. Може да бъде объркващо и разочароващо. Опитът и стабилната ръка тук ще бъдат много важни. До изгрев слънце бихме искали да сме на или под южния връх, с още два часа в ръка, за да стигнем върха.\r\n\r\nМаршрутът до Hillary Step е тесен и вълнуващ и неизбежно в ден с хубаво време ще има опашка в дъното на стъпалото и тук няма друг избор, освен да чакате. Стъпката може да е камениста или покрита със сняг и обикновено отнема само около двадесет минути, за да се премине. Оттам последните двеста метра до върха са лесна разходка. Целта е да пристигнете в средата на сутринта, като оставите целия останал ден, за да слезете обратно в лагер 4 и да си починете. Някои силни отбори желаят да стигнат до Лагер 3, но това не е приемливо, ако остави шерпите на високо ниво с огромно количество работа за вършене.\r\n\r\nВРЪЩАНЕ ОТ ЕВЕРЕСТ\r\nНяколко дни, прекарани обратно в базовия лагер, помагайки за разчистването на лагера, са последвани от преход обратно до Лукла и полет до Катманду. Някои хора избират да наемат хеликоптер, което е добре, но ние смятаме, че е важно да помогнем на шерпите да изчистят планината, а не просто да напуснат. Общата учтивост и уважение предполагат, че всеки ще се включи в разпадането на лагера, това е много по-приятно и трябва да се разглежда като част от пътуването и преживяването. Отнема много време, за да се обработи и усвои подобно преживяване, наистина няма нужда да бързате направо към Катманду.",
                OrganiserId = "6d5800ce-d726-4fc8-83d9-d6b3ac1f591e",
            });

            return expeditions.ToArray();
        }
    }
}
