using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using PeaksAndAdventures.Infrastructure.Data.Enums.Route;
using PeaksAndAdventures.Infrastructure.Data.Models;

namespace PeaksAndAdventures.Infrastructure.Data.Configurations
{
    public class RouteConfiguration : IEntityTypeConfiguration<Route>
    {
        public void Configure(EntityTypeBuilder<Route> builder)
        {
            //builder.HasData(GenerateRoutes());
        }

        private Route[] GenerateRoutes()
        {
            ICollection<Route> routes =  new HashSet<Route>();
            
            routes.Add(new Route()
            {
                Id = 1,
                Name = "Връх Безбог",
                Description = "Връхът може да се изкачи по два маршрута. Най-популярният е като тръгнете към “душеватката” и Попово езеро, след което се изкачите на седловината между върховете Полежан и Безбог (вторият етап на прехода, който сме описали тук, но в обратна посока). Маршрутът тръгва покрай десния бряг Безбожкото езеро, където вдясно ще видите изоставена постройка. Това са руините на старата хижа „Безбог“, която е разрушена от лавина през 1971 година. Пътеката към върха минава вляво на постройката. По тази пътека няма маркировка, но „пирамидките“ от камъни могат да ви водят.Поглед към връх Безбог в Пирин.Пътеката е доста стръмна и през по- голямата част е през клекове. Малко преди върха започва каменист участък, който също е стръмен. Внимавайте къде стъпвате между камъните.На самия връх има кръст и веднага ще го познаете щом го видите.Гледката оттук е много красива: на Изток част от Кременското езеро, до него върховете Севрия, Джано, Джангал както и част от Поповото езеро. В другата посока се виждат връх Полежан, Стражите и Десилица.",
                StartingPoint = "Хижа Безбог",
                Difficulty = Difficulty.Moderate,
                DisplacementPositive = 450,
                DisplacementNegative = 450,
                Duration = new TimeSpan(0, 2, 40, 00),
                ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSCF5440-1024x819.webp",
                MountainId = 3
            });

            routes.Add(new Route()
            {
                Id = 2,
                Name = "Връх Мусала – най-високият връх в България и на Балканите",
                StartingPoint = "Хижа Ястребец",
                Description = "Хижа „Ястребец“ – хижа „Мусала“\r\nОт лифта тръгнете по главната пътека към хижата. Пътеката е почти равна и широка. Най-вероятно ще видите много хора и трудно бихте се объркали. Маршрута до хижата отнема около час, а маркировката, която трябва да следвате е червена. Повече информация може да прочетете в статията ни за хижа „Мусала.\r\n\r\nВръх Иречек вляво и връх Мусала вдясно, отпред Мусаленското езеро\r\nХижа „Мусала“ – Ледено езеро\r\nСлед като стигнете хижа „Мусала“ ви остават около 2 часа преход до върха. До хижата се намират първите три езера от езерната група Мусаленски езера. Тръгнете по дясната страна на езерото пред хижа „Мусала“. От тук започва постепенно изкачване, пътеката става все по-камениста и все по-често се върви по морени. По пътеката ще минете покрай две езера, първото от които е Алековото езеро. След около 30-35 минути ще достигнете до Леденото езеро.\r\n\r\n\r\nЛедено езеро – връх Мусала\r\nСега е моментът да си отдъхнете преди последното изкачване. То е най-трудно и изморително заради голямата денивелация. Тук е и единствената чешма по пътя.\r\n\r\n\r\n\r\nИма две пътеки – лятна и зимна. Зимната е камениста и стръмна, но има обезопасително метално въже.\r\n\r\n\r\nЗа по-неопитните туристи е препоръчително да изберат лятната пътека. След около половин час нагоре ще стигнете най-високата точка на България.\r\n\r\nГледка от връх Мусала към Леденото езеро\r\n\r\nПред вас ще се открие уникална гледка към върхове и езера. На юг са Маричините езера, на север – Ледено езеро и местността, от която дойдохте, на изток – върховете Малка Мусала (2902 м) и Иречек (2852 м). При ясно време можете да видите в далечината на запад връх Мальовица.",
                Difficulty = Difficulty.Moderate,
                DisplacementNegative = 104,
                DisplacementPositive = 684,
                Duration = new TimeSpan(0, 6, 00, 00),
                ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSC6986-1024x680.webp",
                MountainId = 2
            });

            routes.Add(new Route()
            {
                Id = 3,
                Name = "Хижа „Мазалат“ – уют и красиви гледки в Стара планина",
                StartingPoint = "Партизанска Песен",
                Description =
                    "Хижа „Партизанска Песен“ – чешма\r\nПътеката започва от хижа „Партизанска песен“, като първите 30 минути се върви в прохладна гора. Маршрутът до хижата е част от Е3, по-известен като Ком-Емине, и е добре маркиран (следвайте Пътеката започва от хижа „Партизанска песен“, като първите 30 минути се върви в прохладна гора. Маршрутът до хижата е част от Е3, по-известен като „Ком-Емине“, и е добре маркиран (следвайте червената маркировка). Пътеката ясно се вижда и трудно бихте могли да се изгубите. След приятната горичка лека по-лека наклона става по-голям и излизате на открит участък, от където в далечината се виждат върховете Бузлуджа и Шипка, както и няколко вятърни турбини. Има едно местенце с голямо дърво и пейки, където можете да направите кратка почивка. Не след дълго се излиза на чешмичката, тя е над пътеката и трябва да внимавате да не я пропуснете. Отдъхнете и напълнете вода, защото е единствената по пътя.\r\n\r\n\r\n\r\n\r\nЧешма – хижа „Мазалат“\r\nОт чешмичката поемете нагоре и надясно по баира. Тук е най-голямото изкачване от маршрута. Тази част се минава трудно, защото през лятото е пълно с боровинки, на които не бихте устояли. След като изкачите възвишението пътеката става почти равна и навлиза в букова гора. Не забравяйте да вдигате достатъчно шум, за да избегнете среща с дивите животни и най-вече с мечките. Пътеката е много приятна и живописна. Скоро след като излезете от гората ще стигнете табела на Национален парк, от там пътят става широк и открит. Това е последната част от маршрута. До хижата остават около 20-30 минути. В хижата можете да хапнете, починете и да се насладите на гледките към масива Триглав. Ако имате достатъчно време, може да се разходите до връх Вълча глава (30 минути), скален феномен Пеещите скали (55 минути) или да направите маршрута до връх Голям Кадемлия.",
                Difficulty = Difficulty.Moderate,
                DisplacementNegative = 151,
                DisplacementPositive = 498,
                Duration = new TimeSpan(0, 6, 0, 0),
                ImageUrl = "https://planinka.bg/wp-content/uploads/2022/02/MANE7558-copy-1024x683.webp",
                MountainId = 1
            });

            routes.Add(new Route()
            {
                Id = 4,
                Name = "Хижа „Синаница“ и Синанишко езеро – едно от най-красивите в България",
                StartingPoint = "Хижа Вихрен",
                Description = "Хижа „Вихрен“ – Муратово езеро\r\nНачалото на маршрута е от хижа „Вихрен“. Следвате синьо-жълтата маркировка, като трябва да тръгнете нагоре по стълбичките пред хижата. Оттам има леко изкачване по камъни, а след това и кратък равен участък. След 10-15 минути от началото на маршрута ще стигнете мостче. Вместо да минавате по него, трябва да тръгнете надясно по камъните, успоредно на реката.\r\nМалко след това има 15 минутно изкачване, което е най-трудната част от маршрута. Пътеката завива надясно и не след дълго пред вас ще се открие Муратовото езеро. В нашата статия може да прочетете подробно описание на маршрута от хижа „Вихрен“ до Муратово езеро.\r\nМуратово езеро – Бъндеришка порта\r\nОт Муратово езеро поемете наляво и продължeте нагоре по сипеите, като следвате синьо-жълтата маркировка. Непременно се обърнете назад, за да се насладите на езерото от високо. След като превалите баира не се заблуждавайте, че това е Бъндеришката порта. Следва по-равна част. Отляво ще видите няколко езера от групата Овинати и продължете по пътеката, която криволичи през клекове. Най-накрая ще зърнете в далечината портата, която е седловината между Муратов връх и Дончови караули.\r\nОттук започва изкачване по морени, камънаци и сипеи. На места е доста стръмно и трябва да си помагате с ръце и да внимавате къде стъпвате. Оглеждайте се за синьо-жълтата маркировка по камъните, за да не се отклоните от целта. Частта от Муратово езеро до Бъндеришка порта се минава за час и малко. След като стъпите на Бъндеришка порта пред вас се разкрива гледка към обширното Спано поле.\r\n\r\n\r\nБъндеришка порта – Синанишка порта\r\nОт Бъндеришката порта следвайте синята маркировка и продължете леко надясно. Следва и най-приятната част от прехода – вървите по почти равна и добре отъпкана пътека. Местността, в която се намирате се нарича Голямо Спано Поле. По пътя може да срещнете много стада с крави и диви коне. Ако стадата са на пътеката е добре да ги заобиколите, защото наоколо е възможно да има и кучета, които да се спуснат към вас, затова бъдете внимателни!\r\n\r\nПътеката към Синанишкото езеро\r\nСлед равния участък започва леко изкачване към Синанишката порта, което не е трудно, но отново трябва да внимавате. Когато стигнете портата идва и една от най-хубавите части – гледката към кристалните води на Синанишкото езеро и стръмните бели склонове на връх Синаница.\r\nСинанишка порта – Синанишко езеро и хижа „Синаница“\r\nОт портата следва продължително слизане към хижа „Синаница“- първоначално по камъни, а след това по мека пътека измежду клековете.\r\nСинанишкото езеро и хижа Синаница\r\nХижата изглежда близо, но слизането е продължително, все надолу и надолу. Най-накрая зад един завой се вижда простор за пране и след него се открива гледка към хижата и сините води на езерото. На юг от езерото се вижда връх Синаница (2516 м).\r\n\r\nСинанишкото езеро\r\nВръх Синаница в Пирин планина\r\nМаршрутът не е много труден, с редуващи се изкачвания и равни участъци и с изглед към красивите пирински езера. Оттук може да изкачите връх Синаница, да минете през Синанишка порта към заслон „Спано поле“ или да се върнете по обратния път до хижа „Вихрен“.",
                Difficulty = Difficulty.Moderate,
                DisplacementNegative = 436,
                DisplacementPositive = 663,
                Duration = new TimeSpan(0, 3, 50, 0),
                ImageUrl = "https://planinka.bg/wp-content/uploads/2022/09/DSCF1021-copy-1024x683.webp",
                MountainId = 3
            });

            routes.Add(new Route()
            {
                Id = 5,
                Name = "град Калофер – водопад Райското пръскало",
                Description = "От Калофер до местността Долен Параджик\r\nТръгваме към Райското пръскало от местността Паниците в Калофер. Маршрутът започва по стръмна горска пътека, която продължава около половин час. След като излезем от горския пояс, наклонът рязко намалява. Намираме се на обширни поляни, по които се движим в следващия час и петнайсетина минути. Тук е много горещо в летните дни. Препоръчвам ранно тръгване, за да избегнете обедния ад. Първата чешма се намира двайсетина минути след края на гората, леко вляво.\r\nСлед повече от час вървене на открито, излизаме на разклон в местността Долен Параджик. Наляво е екопътека „Бяла река“, надясно е жълтият маршрут за връх Ботев, а направо е нашата пътека към хижа Рай и Райското пръскало. 5 минути след разклона се открива една от най-красивите гледки по българските планини – към Джендема и връх Ботев над него. Зашеметяваща е! Има няколко пейки, на които да починете с тази гледка насреща. Общо от Калофер до тук е около 1:45 ч.\r\nОт местността Долен Параджик до хижа Рай\r\nНавлизаме в резерват Джендема, по чийто скалисти склонове тече Райското пръскало. Поглед напред разкрива какво ни очаква – слизане до долината под нас и изкачване до гребена на Райските купени отсреща. Хижа Рай се намира на върха му, от другата страна на гората.\r\nЗапочваме леко спускане по широк черен път, който навлиза в букова гора. След 15-20 минути пътят свършва на едно уширение. Вляво от него тръгва тясна горска пътека. Гората се сгъстява, а наклонът се увеличава, но не много. Скоро достигаме река Малка Бъзовица, след която наклонът се обръща нагоре. Малко след нея стигаме до чешмата Мечата глава. Бях по този маршрут през септември и почти не течеше вода по чучура. За щастие след десетина минути има друга чешма, която течеше нормално.\r\nМного скоро наклонът рязко се увеличава – веднага след като прекосим едно поточе. Оттук нататък вървенето става доста тежко в продължение на час и половина, може и повече – почти до хижа Рай. За щастие гората е гъста и предпазва от жаркото слънце. След като излезем от горския пояс, остават пет минутки до хижата. Ето че красивата ни цел се вижда ясно зад нея – Райското пръскало се спуска по Джендема.\r\nОт хижа Рай до Райското пръскало\r\nАко мислим, че се е свършило – не е така. Имаме още половин час до Райското пръскало по също толкова стръмна пътека, колкото досега. Продължаваме от другата страна на хижа Рай, минаваме покрай параклиса и се запътваме в посока водопада. Точно където се прекосява река Пръскалска, на първия завой на пътеката край едни камъни има разклонение. Основният маршрут продължава към Тарзановата пътека и връх Ботев, а вдясно излиза малка пътека, по която ние трябва да тръгнем. Тук ще вметна, че ако идвате май и юни, е много вероятно реката да е пълноводна. Затова е препоръчително да бъдете с хубави непромокаеми обувки.\r\nОттук до Райското пръскало няма много за описване. Само ще обърна внимание, че на места пътеката е сипеста и хлъзгава, но нищо сериозно. След двайсетина минути сме в подножието на водопада.\r\nВъзможност за продължение на маршрута е да слезем и да поемем по маршрута от хижа Рай до връх Ботев или към хижа Васил Левски.",
                Difficulty = Difficulty.Moderate,
                DisplacementPositive = 894,
                Duration = new TimeSpan(0, 5, 00, 00),
                ImageUrl = "https://izbulgaria.com/wp-content/uploads/2021/07/raiskoto-praskalo-768x576.jpg",
                MountainId = 1
            });

            routes.Add(new Route()
            {
                Id = 6,
                Name = "Североизточен ръб - Еверест",
                StartingPoint = "Базов лагер Еверест",
                Description =
                    "Североизточният ръб (наричан просто северен) започва от северната страна на планината, в Тибет. Експедицията прави преход пеша по каменист път до ледника Ронгбук, където на 5180 m се намира базовият лагер. За да достигнат Лагер 2, катерачите преминават през средно големи морени по източната страна на Ронгбук до базата Чангце на 6100 m. Лагер 3 (Преден базов лагер) се намира под Северното седло на 6500 m. За да достигнат до Лагер 4, катерачите се изкачват по ледника, след което по фиксирани въжета достигат до върха на Седлото (7010 m). Оттам следва изкачване по каменистия северен ръб, до Лагер 5 на 7775 m. Следва диагонално подсичане на северното било до Жълтия пояс, където се намира Лагер 6 на 8230 m. Оттам катерачите атакуват върха.Катерачите се сблъскват с коварното препятствие, което представлява Първото стъпало на 8534 m. Следва Второто стъпало (~8600 m). За неговото преодоляване се използва съоръжение, наречено „Китайската стълба“ – постоянна метална стълба, поставена през 1975 г. от китайска експедиция. Оттогава тя неизменно служи на катерачите, и на практика всеки атакуващ върха е минал през нея. Третото стъпало (8689 – 8800 m) се преодолява почти пълзешком. След стъпалата до върха остават снежен наклон под почти 50 градуса и финалният хребет..",
                Difficulty = Difficulty.Difficult,
                DisplacementPositive = 3669,
                DisplacementNegative = 3669,
                Duration = new TimeSpan(40,0,0,0),
                ImageUrl = "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Mount_Everest_North_Face.jpg/220px-Mount_Everest_North_Face.jpg",
                MountainId = 6
            });

            routes.Add(new Route()
            {
                Id = 7,
                Name = "Маршрутът на Абруци - К2",
                StartingPoint = "Базов лагер К2",
                Description =
                    "Абруци е маршрутът на K2, като 75% от алпинистите се справят с този проход, който се намира от пакистанската страна на планината. Този маршрут получава името си от принц Луиджи Амедео, херцог на Абруци, който за първи път се опитва да го пресече през 1909 г.Абруци минава покрай някои от най-техничните изкачвания на планината, „Коминът на къщата“ и „Черната пирамида“. Той също така вижда катерачи нагоре по „Гърлото на бутилката“, което се намира точно вляво от опасните сераци. Именно на това място през 2008 г. поредица от инциденти доведоха до смъртта на 11 алпинисти.",
                Difficulty = Difficulty.Difficult,
                DisplacementPositive = 3461,
                DisplacementNegative = 3461,
                Duration = new TimeSpan(60, 0, 0, 0),
                ImageUrl = "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/K2_Abruzzi_Spur.jpg/220px-K2_Abruzzi_Spur.jpg",
                MountainId = 11
            });

            routes.Add(new Route()
            {
                Id = 8,
                Name = "Gouter route - Монблан",
                StartingPoint = "Nid d'Aigle",
                Description = "\"Gouter Route\" се е превърнал в \"нормалния маршрут\" за изкачване на Мон Блан. От техническа гледна точка, това е най-малко трудния път към върха, но не бива да бъде подценяван. Изкачването до хижа Gouter не е само ходене по една туристическа пътека, пътят минава през заледен терен и трябва да се справяте и с надморската височина. В средата на лятото големият брой хора по този маршрут увеличават обективните опасности: каменопади, опашки от изчакващи се хора при тесните участъци, навалица в хижата. За щастие, тези дразнители не правят маршрута по-малко интересен: \"Покрива на Европа\" е красив за изкачване връх, дори по нормалния път, и е удивително изживяване. Изкачването до Егюй дю Гутер на светлината на челниците, бавното набиране на височина по склоновете, преминаването на тесния хребет Босе, осветен от сутрешното слънце, остава незаличими следи в умовете на тези, осмелили се да приемат предизвикателството на тези височини.",
                Difficulty = Difficulty.Difficult,
                DisplacementPositive = 2426,
                DisplacementNegative = 2426,
                Duration = new TimeSpan(2, 0, 0 ,0),
                ImageUrl = "https://static.wixstatic.com/media/4bb50d_3e741a5aef4b434aa34a25bc182ea9e0~mv2.jpg/v1/fill/w_979,h_552,fp_0.50_0.50,q_85,usm_0.66_1.00_0.01,enc_auto/4bb50d_3e741a5aef4b434aa34a25bc182ea9e0~mv2.jpg",
                MountainId = 7
            });

            return routes.ToArray();
        }
    }
}
